[
  {
    "name": "林筱玫",
    "email": "lydia.hmlin@gmail.com",
    "latestUpdate": "2024-12-23 10:32:51",
    "objective": "本課程旨在以專題設計方式，訓練學生確認並建立需求、發展設計選擇方案、製作設計的互動形式、設計評估的專業知能，特別著重於 VR/AR 技術的應用，旨在智慧空間中創造更佳的使用者體驗，並以設計專案方式演練完整之設計過程。學生經由分組合作或獨自創作完成一媒體設計主題。上學期課程以題目釐定、資料蒐集、分析調查、設計定義、構想發展、程式設計、雛型製作等活動為教學內容；下學期則進行觀察測試、使用性評估、程式調校、專刊編輯、展示佈置以及設計報告提交等為教學內容，以培養學生具備互動設計專題製作之專業知能。\n\nThis course aims to train students to identify and establish needs, develop design alternatives, create interactive forms, and acquire professional knowledge in design evaluation through project-based learning. Special emphasis is placed on applying VR/AR technology to create enhanced user experiences in innovative spaces while practicing a complete design process through project execution. The course's learning materials in the first semester include subject clarification, data collection, analysis and investigation, design definition, concept development, programming, and prototyping. In the second semester, learning materials of the course include observation and testing, usability evaluation, programming debug, report editing, exhibition and design report submission. Accordingly, students will be ready for professional competencies of interaction design projects.",
    "schedule": "1. 課程規劃說明\n2. 分組討論\n3. 分組討論\n4. 【共評一】設計構想提案發表\n5. 分組討論\n6. 分組討論\n7. 分組討論\n8. 分組討論\n9. 【共評二】設計進度發表\n10. 分組討論\n11. 分組討論\n12. 分組討論\n13. 分組討論\n14.【共評三】設計進度發表\n15. 分組討論\n16. 分組討論\n17. 分組討論\n18.【期末總評日】互動技術操作與展示",
    "scorePolicy": "共評一～共評三\t60%\n期末總評日\t25%\n出缺勤表現與貢獻度\t15%",
    "materials": "No.",
    "consultation": "Group guidance contact account: Create a Line group when the class startsCourse host contact account:https://www.facebook.com/berrymeiTeacher’s school Gmail account: Lydia@mail.ntut.edu.tw",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "洪兆宣",
    "email": "Leora50@hmail.com",
    "latestUpdate": "2024-12-25 08:24:26",
    "objective": "本課程旨在整合應用程式與設計，完成具互動媒體設計作品。為達成此目標，本課程培養學生熟悉與整合互動設計的理論、方法與應用，以具互動性的媒體設計議題，訓練學生獨立創作或分組合作設計，藉此訓練學生創意思考、應用科技與新知的實作能力，同時也可結合產學合作專案於教學活動內，達到務實致用的目標。\nThis course applies design and programming into interaction design projects relating to media design. To achieve this goal, students will familiarize the theories, methodology and implications of interactive media design in this course. By interaction design issues, students create and implement ideas by brainstorming through independent study or cooperative learning. For competition without any gap, industry-academic cooperation is one way to prepare student’s critical competencies same as the desired competencies required by the industry.",
    "schedule": "1. 課程規劃說明\n2. 分組討論\n3. 分組討論\n4. 【共評一】設計構想提案發表\n5. 分組討論\n6. 分組討論\n7. 分組討論\n8. 分組討論\n9. 【共評二】設計進度發表\n10. 分組討論\n11. 分組討論\n12. 分組討論\n13. 分組討論\n14.【共評三】設計進度發表\n15. 分組討論\n16. 分組討論\n17. 分組討論\n18.【期末總評日】互動技術操作與展示",
    "scorePolicy": "共評一～共評三\t60%\n期末總評日\t25%\n出缺勤表現與貢獻度\t15%",
    "materials": "社會設計，社會企業概論",
    "consultation": "Group guidance contact account: Create a Line group when the class startsCourse host contact account:https://www.facebook.com/berrymeiTeacher’s school Gmail account: Lydia@mail.ntut.edu.tw",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "莊育鯉",
    "email": "chuang.yuli@gmail.com",
    "latestUpdate": "2024-12-20 10:29:29",
    "objective": "本課程旨在以專題設計方式，訓練學生確認並建立需求、發展設計選擇方案、製作設計的互動形式、設計評估的專業知能，並以設計專案方式演練完整之設計過程。學生經由分組合作或獨自創作完成一媒體設計主題。上學期課程以題目釐定、資料蒐集、分析調查、設計定義、構想發展、程式設計、雛型製作等活動為教學內容；下學期則進行觀察測試、使用性評估、程式調校、專刊編輯、展示佈置以及設計報告提交等為教學內容，以培養學生具備互動設計專題製作之專業知能。\nThrough project design, the course prepares students to confirm the needs of design, develop alternatives of media design projects, create interactive modes, and evaluate design performance through independent study or cooperative learning. The course's learning materials in the first semester include subject clarification, data collection, analysis and investigation, design definition, concept development, programming, and prototyping. In the second semester, learning materials of the course include observation and testing, usability evaluation, programming debug, report editing, exhibition and design report submission. Accordingly, students will be ready for professional competencies of interaction design projects.",
    "schedule": "1. 課程規劃說明\n2. 分組討論\n3. 分組討論\n4. 【共評一】設計構想提案發表\n5. 分組討論\n6. 分組討論\n7. 分組討論\n8. 分組討論\n9. 【共評二】設計進度發表\n10. 分組討論\n11. 分組討論\n12. 分組討論\n13. 分組討論\n14.【共評三】設計進度發表\n15. 分組討論\n16. 分組討論\n17. 分組討論\n18.【期末總評日】互動技術操作與展示",
    "scorePolicy": "共評一～共評三\t60%\n期末總評日\t25%\n出缺勤表現與貢獻度\t15%",
    "materials": ".",
    "consultation": ".",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG11：永續城市與社區（Sustainable Cities and Communities）",
    "remarks": ".",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "龍祈澔",
    "email": "drag0725@yahoo.com.tw",
    "latestUpdate": "2024-12-20 15:34:39",
    "objective": "本課程旨在整合應用程式與設計，完成具互動性的視覺傳達設計作品。為達成此目標，本課程培養學生熟悉與整合互動設計的理論、方法與應用，以具互動性的視覺設計議題，訓練學生獨立創作或分組合作設計，藉此訓練學生創意思考、應用科技與新知的實作能力，同時也可結合產學合作專案於教學活動內，達到務實致用的目標。\nThis course applies design and programming into interaction design projects relating to visual communication design. To achieve this goal, students will familiarize the theories, methodology and implications of visual communication design in this course. By interaction design issues, students create and implement ideas by brainstorming through independent study or cooperative learning. For competition without any gap, industry-academic cooperation is one way to prepare student’s critical competencies same as the desired competencies required by the industry.\n\n於第十八周最後一次評圖進行本學期總檢，以規劃畢製與前導製作為本學期方向。前導製作將為完整形式的呈現，其包含較小規模內容，與畢制將會運用的形式與技術之實驗性探索並整合後呈現，進而發展出，具深度且有規模之畢制成品。",
    "schedule": "週 01.\t課程與授課老師介紹\n週 02.\t設計實務\n週 03.\t設計實務\n週 04.\t設計實務\n週 05.\t第一次評圖 (初步提案)\n週 06.\t設計實務\n週 07.\t設計實務\n週 08.\t設計實務\n週 09.\t設計實務\n週 10.\t第二次評圖 (進階報告)\n週 11.\t設計實務\n週 12.\t設計實務\n週 13.\t設計實務\n週 14.\t設計實務\n週 15.\t第三次評圖 (進度討論與講評)\n週 16.\t設計實務\n週 17.\t設計實務\n週 18.\t期末總檢",
    "scorePolicy": "【評分標準】\n1. 原創性: 30%，\n2. 視覺設計 (包括 PPT): 30%\n3. 切題性: 20%\n4. 製作可行性 (邏輯合理性): 20%",
    "materials": "依小組導師專業領域與題目決定",
    "consultation": "可於 FB Messenger 即時聯繫詢問: https://www.facebook.com/lung.ian/",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG5：性別平等（Gender Equality）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG10：減少不平等（Reduced Inequalities）SDG11：永續城市與社區（Sustainable Cities and Communities）",
    "remarks": "SDGs 指標可依專題指導組，所分配業師的專業領域進引導與發展。",
    "foreignLanguageTextbooks": false
  }
]
