[
  {
    "name": "林筱玫",
    "email": "lydia.hmlin@gmail.com",
    "latestUpdate": "2024-12-23 10:27:52",
    "objective": "This course aims to train students to identify and establish needs, develop design alternatives, create interactive forms, and acquire professional knowledge in design evaluation through project-based learning. Special emphasis is placed on applying VR/AR technology to create enhanced user experiences in innovative spaces while practicing a complete design process through project execution. The course's learning materials in the first semester include subject clarification, data collection, analysis and investigation, design definition, concept development, programming, and prototyping. In the second semester, learning materials of the course include observation and testing, usability evaluation, programming debug, report editing, exhibition and design report submission. Accordingly, students will be ready for professional competencies of interaction design projects.\n\n本課程旨在以專題設計方式，訓練學生確認並建立需求、發展設計選擇方案、製作設計的互動形式、設計評估的專業知能，特別著重於 VR/AR 技術的應用，旨在智慧空間中創造更佳的使用者體驗，並以設計專案方式演練完整之設計過程。學生經由分組合作或獨自創作完成一媒體設計主題。上學期課程以題目釐定、資料蒐集、分析調查、設計定義、構想發展、程式設計、雛型製作等活動為教學內容；下學期則進行觀察測試、使用性評估、程式調校、專刊編輯、展示佈置以及設計報告提交等為教學內容，以培養學生具備互動設計專題製作之專業知能。",
    "schedule": "1. Course planning instructions\n2. Group discussion\n3. Group discussion\n4. [Common Comment 1] Publish design concept proposal\n5. Group discussion\n6. Group discussion\n7. Group discussion\n8. Group discussion\n9. [Common Comment 2] Release of design progress\n10. Group discussion\n11. Group discussion\n12. Group discussion\n13. Group discussion\n14. [Total review three] Design progress announcement\n15. Group discussion\n16. Group discussion\n17. Group discussion\n18. [Final Evaluation Day] Interactive technology operation and display",
    "scorePolicy": "Rated 1 ~ Rated 3  60%\nFinal evaluation demo day 25%\nAbsence performance and contribution 15%",
    "materials": "No.",
    "consultation": "Group guidance contact account: Create a Line group when the class startsCourse host contact account:https://www.facebook.com/berrymeiTeacher’s school Gmail account: Lydia@mail.ntut.edu.tw",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
