[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2024-12-25 17:20:03",
    "objective": "本課程的目的是幫助學生在 21 世紀準備行銷管理業務並為之做出貢獻。無論是計畫在企業、政府還是非營利組織工作，有關營銷的概念、策略和技術都是相關的主體應用。本課程是：從基本概念到與營銷經營相關，再到營銷在組織中的策略運用；並重視品牌應用的底層邏輯。強調消費者營銷和企業營銷之間的相同點和不同點。將需求預測與其市場區隔、目標定位和市場定位相結合，在接觸消費者和商業市場以及市場區格之後，涵蓋市場營銷研究。在學生掌握市場營銷的含義後，整合規劃、實施和評估以提供眾向的行銷策略。\n除了重視現行客戶，對於非顧客群，也是非常重視和其開發性。\n\nThis course aims to help students prepare and operate in an organization and contribute to the 21st century. Regardless of whether a person intends to work in a business, or the government, or in a nonprofit organization, the concepts, strategies, and techniques of effective marketing are relevant. This course is:\nProviding fundamental concepts through the major tasks associated with marketing to the strategic role of marketing in an organization.\nBringing early attention to the global nature of marketing.\nEmphasizing the similarities as well as the differences between consumer and business marketing.\nCombining demand forecasting with its logical antecedents-segmentation, targeting, and position.\nThis course will cover marketing research, marketing campaigns, marketing channels, and strategy. Having students have been exposed to consumer (B2C) and business (B2B) markets, they will learn how to segment and position their corporate and product market positions, where they will understand the Integrating planning, implementation, and evaluation so as to provide a broad strategic context afterward.",
    "schedule": "Week 01\tCourse Introduction  \n                Chap. 1 -Defining Marketing for the New Realities\nWeek 02\tChap. 2 - Developing Marketing Strategies and Plans\n                Chap. 3 - Gathering Information and Forecasting Demand\nWeek 03\tPlan for Field Study | Research\nWeek 04\tChap 4 – Conducting Marketing Research\nWeek 05\tChap. 5 - Creating Customer Value, Satisfaction, and Loyalty\n                Chap. 6 - Analyzing Consumer Markets\nWeek 06\tChap. 7 - Analyzing Business Markets\n                 Chap.8 - Identifying Market Segments and Targets\nWeek 07\tChap. 9 - Creating Brand Equity\n                Chap. 10 - Crafting the Brand Positioning\nWeek 08\tChap.11 - Competitive Dynamics\nWeek 09\tMid-term Exam by Group Presentation\nWeek 10\tChap. 12 - Setting Product Strategy\n                Chap. 13 - Designing and Managing Services\nWeek 11\tInvite Speaker 講者邀請\nWeek 12\tChap. 14 - Developing Pricing Strategies and Programs\nWeek 13\tChap. 15 - Designing and Managing Marketing Channels and Value Networks\n                Chap. 16 - Managing Retailing, Wholesaling, and Logistics\nWeek 14\tChap. 17 - Designing and Managing Integrated Marketing Communications \n                Chap. 18 - Managing Mass Communications: Advertising, Sales \nPromotions, Events, and Public Relations\nWeek 15\tChap. 19 Managing Digital Communications: Online, Social Media, & Mobile\nWeek 16\tChap. 20 - Managing Personal Communications: Direct Marketing and Personal Selling\nWeek 17\tChap. 21 - Introducing New Market Offerings\n                Chap. 22 - Tapping into Global Markets\nWeek 18\tFinal-Exam (Final Report) Managing a Holistic Marketing Organization",
    "scorePolicy": "Evaluation/Assessments：\nMid Term    25%\t(Group Presentation-4-5 people in a group)\nFinal Term   25%\t(Paper Exam + Group Presentation)\nParticipation  50%  (30% Attendance on time got 2 points) (20% Class participation, such as asking and answering questions)\n\tProof of documents required, such as sick leave notice to be provided later.\n\tA wrap-up presentation of previous class is required in next class.\n\t360-degree evaluation at the end of the class by peers.\nTeacher Contact information:",
    "materials": "Marketing Management 15/EGlobal Edition by \n1st author PHILIP KOTLER Northwestern University\n2nd author KEVIN LANE KELLER Dartmouth College 忠誠的顧客對企業來說就是 Lampel, J., & Germain, O. Creative industries as hubs of new organizational and business practices. In. UK: Elsevier (2016)\n\nYang, Angela, Shiyi Multimedia Corporation: The Value Conversion of Intellectual Property of SanYu Special Exhibition (2021)  產業鏈上利害關係人 (Stakeholders 管理)\n\nConley, J. G., Bican, P. M., & Ernst, H. Value Articulation: A Framework For The Strategic Management of Intellectual Property. California Management Review, 55 (4), 102-120. doi:10.1525/cmr.2013.55.4.102 (2013)",
    "consultation": "Teacher Contact information:Email: shenchu.yang@gmail.com | Cell Phone: 0932302756 | Line:shenchu.yang",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG5：性別平等（Gender Equality）SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG10：減少不平等（Reduced Inequalities）",
    "remarks": "This course will contend with heavy group discussion; those who enjoy engaging in interactive learning and group discussion are welcome.Group formation and begin the process of selecting the product or serviceFormation of groups; a first presentation of “product” to the instructor for approval.Competitive information and environmental scanning project(s) completed and presented for instructor’s review.Initial marketing research parameters completed; demand forecasting, and target market selections defined.",
    "foreignLanguageTextbooks": true
  }
]
