[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2024-12-23 17:02:51",
    "objective": "本課程幫助學生習得敘述、描寫、推論、議論、省思、說明等文體方面的寫作技巧，並指導學生從閱讀、圖片、日常生活事件，及課堂討論內容中取材，以加強邏輯思考和流暢寫作能力。\nThis course aims to develop and reinforce students' strengths to create unified and coherent pieces of composition in a variety of styles--narrative, descriptive,  argumentative, reflective, and expository.  Students will be guided to write in response to readings, pictures, events in their daily lives, and discussions from the class.  Thought-provoking topics dealing with current issues are used to stimulate and foster critical writing strategies. This course enables students to write and discuss logically and clearly; they also need to incorporate grammatically newly-built vocabulary into their writing.",
    "schedule": "Week\tTopic\n1\tIntroduction to the course \nUnit 1. Synthesis Writing \n2\tMemorial Day—No Class\n3\tIdentify themes and multiple arguments\n4\tIntegrate sources\nSummarizing, paraphrasing & quotation\n5\tLibrary workshop \n6\tBody development and drafting \n7\tChildren’s Day—No Class\n8\tDrafting & revision \n9\tMid-Term Exam \nEssay #1 Due\nUnit 2: Controversy Analysis\nTopic brainstorming\n10\tResearch proposal due & presentation\n11\tFind sources, evaluate sources, organize sources \nMaking an outline\n12\tEvaluating sources\nSynthesizing, paraphrasing and integrating sources\n13\tEssay development \n14\tDrafting & revision\n15\tEssay #2 Due \nUnit 3. Argumentative Writing\nPosition statement and claims\n16\tArgument development \n17\tDrafting & revision\n18\tEssay #3 Due\n\nNote: The schedule may be change to changes.",
    "scorePolicy": "The course adopts a 100 point scale for grading. Your grade will be based on the quality of your work in the following areas.\n1.\tEssays and Exam(s) (80 pts/80%): There will be several essays and assignments throughout the course. You will complete these assignments based on the weekly topics (or units) throughout the semester. \n2.\tShort Assignments, Peer Review, Attendance & Participation (20 pts/20%): You are expected to attend every class period and complete in-class activities, assignments, and peer review.\n\nThe following table lists all graded assignments and their point values. The grade percentage is subject to change. In addition, required assignments that carry no point values must be completed in order for you to receive full credit for the rest of the assignment and the course.",
    "materials": "Wyrick, J. (2014). Steps to Writing Well (13th ed.). Boston: Thomson Wadsworth.\n\n*Additional readings will be supplemented.",
    "consultation": "Please contact Dr. Hsin-I Chen by email (hichen@mail.ntut.edu.tw) for questions regarding the course.",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）",
    "remarks": "授課語言：全英語授課",
    "foreignLanguageTextbooks": true
  }
]
