[
  {
    "name": "莊惠鈞",
    "email": "andrewhcc@ntut.edu.tw",
    "latestUpdate": "2024-12-27 08:46:17",
    "objective": "本課程旨在探討如何將 AI 技術應用於語用學研究，著重多元社會情境與語境之下之語言使用分析與詮釋。此課程將深入淺出討論語用學核心理論部分，並結合 AI 大型語言模型 (例如: GPT, Gemini, 以及 Claude 等) 實際操作，讓學生親自學習辨識、分析與評估各種自然語言表現，包含言語行為 (speech acts)、會話隱含 (conversational implicature) 及禮貌策略 (politeness strategies) 等現象。本課程以專題式學習融合理論與實務，幫助同學從全新的 AI 驅動視角進行語用學研究，在分析人類真實語言互動行為之外，更同時能了解 AI 生成文本在語用能力方面的優勢與局限。\nAI & Pragmatics is a graduate-level course that explores how artificial intelligence (AI) can enhance the study of pragmatics by focusing on the analysis and interpretation of language use across diverse social and contextual settings. Students will integrate core theories of pragmatics with hands-on experience using Large Language Models (e.g., GPT, Gemini, and Claude) to identify, analyze, and evaluate key pragmatic phenomena such as speech acts, conversational implicatures, and politeness strategies—and, more importantly, apply these skills to real-world language tasks. Built around project-based learning, the course blends theory with practice, preparing students to conduct research in pragmatics from a fresh, AI-driven perspective. It equips them not only to analyze authentic language interactions but also to critically assess the strengths and limitations of AI-generated texts in terms of pragmatic competence.",
    "schedule": "(Details will be announced during the first week of class.)\n\nWeeks 1–3: Foundations of Pragmatics and AI\n--Core theories of pragmatics (speech acts, implicatures, politeness)\n--Introduction to LLMs (e.g., GPT, Gemini, Claude) and their role in pragmatic analysis\n\nWeeks 4–6: Speech Acts and Conversational Implicatures\n--Speech acts in AI-generated text\n--Conversational implicatures and AI limitations\n\nWeeks 7–9: Politeness and Cross-Cultural Pragmatics\n--Politeness strategies in AI interactions\n--Cross-cultural variations in pragmatics\n\nWeek 10: Midterm Exam\n\nWeeks 11–13: Real-World Applications\n--AI in translation, research, and education\n--Evaluating AI’s pragmatic competence\n\nWeeks 14–15: Project-Based Learning\n--Group projects: Design and analyze pragmatic tasks with AI tools\n--Presentations on findings\n\nWeek 17: (Reserved)\n\nWeek 18: Final Project Presentations",
    "scorePolicy": "Total: 110% (including extra credits) \n\n1. Participation: 25%\n2. Oral Presentation: 25%\n3. Assignments (as needed): 15% \n4. Midterm Exam: 15%\n5. Final Presentation/Report: 30%",
    "materials": "To be updated.",
    "consultation": "By appointment only.",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG5：性別平等（Gender Equality）SDG10：減少不平等（Reduced Inequalities）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG16：和平正義與有力的制度（Peace, Justice and Strong Institutions）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
