[
  {
    "name": "陳儀",
    "email": "chenyi@ntut.edu.tw",
    "latestUpdate": "2024-12-17 20:43:41",
    "objective": "This course is specifically designed for overseas Chinese and Hong Kong-Macau students. Through the study of literary works, discussions on contemporary textual issues, and creative literary writing, it aims to develop students' Chinese comprehension, communication, and appreciation skills while deepening their understanding of culture, the world, and their own lives. Additionally, the course incorporates practical applications to enhance students' proficiency in using Chinese in professional settings.",
    "schedule": "Week 1: Course Introduction\nWeek 2: The World and Zhiguai Literature\nWeek 3: Love and Zhiguai Literature\nWeek 4: Self and Zhiguai Literature\nWeek 5: Fantasy Text Reading and Sharing\nWeek 6: Science Fiction Text Reading and Sharing\nWeek 7: Final Report Discussion: Creative Inspiration\nWeek 8: Anime and Philosophy: Self-Realization\nWeek 9: Film and Philosophy: Free Will\nWeek 10: Film Appreciation\nWeek 11: Final Report Discussion: Content Development\nWeek 12: Project Writing: Campus Observation and Sketching\nWeek 13: Project Writing: Problem Awareness and Data Collection\nWeek 14: Project Writing: Structure and Content\nWeek 15: Project Writing: Sharing and Exchange\nWeek 16: Creative Presentation 1\nWeek 17: Creative Presentation 2\nWeek 18: Creative Presentation 3",
    "scorePolicy": "Class Attendance and Participation: 50%\nProject Writing and Presentation: 20%\nCreative Project: 30%",
    "materials": "I will select some primary Chinese literary works as self-made teaching materials.",
    "consultation": "If you have any questions, please email: chenyi@mail.ntut.edu.tw.",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）",
    "remarks": "1. Course Corresponding Indicators: 4. Quality EducationThe corresponding course content for Indicator 4, \"Education for sustainable development and global citizenship,\" includes teaching topics from Weeks 2-15, which focus on the Chinese literature and philosophy.2. The course topics from Weeks 2 to 10, titled \"Literary Reading and Philosophical Discussion,\" correspond to the \"Explanation\" stage of the innovative character education 6E teaching method. Through reading comprehension and dialogic discussions, students are encouraged to reflect on behavioral norms.",
    "foreignLanguageTextbooks": true
  }
]
