[
  {
    "name": "鍾仁傑",
    "email": "rjchung@mail.ntut.edu.tw",
    "latestUpdate": "2024-12-10 08:54:54",
    "objective": "「天然生物材料特論」旨在探討天然材料在生物系統中的結構、性質與應用。隨著對生物系統的深入研究，科學家逐步發現天然材料擁有優異的性能，如自我修復、抗菌、生物相容性等。本課程將介紹天然生物材料的最新研究進展及其在工程領域的應用，包括生物高分子、生物材料的製備技術及其在醫學、環保及工業中的潛力。本課程涵蓋以下四大主題：（1）天然生物材料概述、（2）天然材料的基本結構單元、（3）天然材料的生物功能及應用、（4）天然材料的仿生與生物製造技術。\n“Natural Biomaterials” is designed to explore the structures, properties, and applications of natural materials in biological systems. Scientists have discovered that natural materials possess outstanding features such as self-repair, antimicrobial properties, and biocompatibility. This course will introduce the latest research developments in natural biomaterials and their applications in engineering fields, including biopolymers, biofabrication, and the potential uses in medical, environmental, and industrial domains. The topics covered in this course will include (1) an overview of natural biomaterials, (2) fundamental building blocks of natural materials, (3) biological functions and applications, and (4) bioinspired and biofabrication technologies.",
    "schedule": "Week 1: Introduction to Natural Biomaterials and Chemical Engineering Applications\n•\tOverview of natural biomaterials and their significance in chemical engineering.\n•\tEmphasizing ethical responsibilities and the societal impact of biomaterials in medicine and environmental sustainability.\nWeek 2: Amino Acids, Proteins, and Polysaccharides: Fundamental Chemistry\n•\tDetailed study of the chemical properties of amino acids, proteins, and polysaccharides.\n•\tApplication of chemical engineering concepts to optimize biomaterials for industrial use.\nWeek 3: Research Planning and Methodology in Biomaterials Science\n•\tIntroduction to planning research projects in the field of biomaterials.\n•\tDiscussion on research ethics, data integrity, and professional responsibility in scientific research.\nWeek 4: Biofabrication Techniques and Innovative Problem Solving\n•\tExploration of biofabrication technologies such as 3D bioprinting and their use in chemical engineering applications.\n•\tCase studies focusing on innovative solutions to complex problems using bio-inspired materials.\nWeek 5: Project Management in Biomaterials Research\n•\tFundamentals of project management for research and development in biomaterials.\n•\tEffective communication and teamwork strategies in the context of interdisciplinary projects.\nWeek 6: Advanced Materials for Environmental and Medical Applications\n•\tApplication of natural biomaterials in chemical processes for environmental protection and healthcare.\n•\tDiscussing the social and environmental responsibilities of engineers in material design.\nWeek 7: Writing Research Papers and Professional Reports\n•\tTechniques for structuring and writing professional research papers in biomaterials.\n•\tFocus on clear communication, scientific rigor, and addressing societal needs in technical writing.\nWeek 8: Midterm Presentation and Feedback Session\n•\tStudents present their ongoing research or theoretical projects.\n•\tFocus on teamwork, communication, and integration of feedback into project development.\nWeek 9: Surface Properties of Natural Biomaterials and Their Applications\n•\tExploration of the surface chemistry of biomaterials and its influence on functionality.\n•\tApplication of chemical engineering concepts in designing surfaces for medical devices and filtration systems.\nWeek 10: International Trends and Collaboration in Biomaterials Research\n•\tIntroduction to global developments and international collaborations in biomaterials research.\n•\tHow chemical engineers can contribute to cross-border research projects and international mobility.\nWeek 11: Adhesion Mechanisms in Biomaterials and Their Engineering Applications\n•\tStudy of adhesion mechanisms in biological materials, with examples such as mussels and barnacles.\n•\tApplication of these natural principles in engineering adhesive materials for industrial use.\nWeek 12: Lifelong Learning and Career Development in Chemical Engineering\n•\tEmphasizing the importance of continuous learning and self-improvement in chemical engineering.\n•\tExploring online resources, conferences, and professional networks for staying updated in the field of biomaterials.\nWeek 13: Problem-Solving in Biomaterials Engineering\n•\tCase studies on real-world challenges in biomaterials engineering.\n•\tEncouraging innovative thinking and independent problem-solving through chemical engineering approaches.\nWeek 14: Managing Research Projects and Teams\n•\tPractical project management skills: organizing research teams, assigning tasks, and tracking progress.\n•\tMethods to improve team collaboration and integrate different scientific disciplines.\nWeek 15: Ethical Implications and Societal Impact of Biomaterials\n•\tDiscussions on the ethical challenges and social responsibilities in biomaterials development.\n•\tAnalyzing the societal impacts of",
    "scorePolicy": "期中考或期中報告 40%，期中課堂表現 10%。\nMidterm exam or midterm report 40%. Midterm class performance 10%.\n期末考或期末報告 40%，期末課堂表現 10%。\nFinal exam or final report 40%. Final class performance 10%.",
    "materials": "Materials from Natural Sources: Structure, Properties, and Applications\n•\tEdited by: Ramesh Gardas, Neha Patni, Amita Chaudhary\n•\tPublisher: CRC Press\n•\tISBN: 9781032538761\n•\t286 pages, 75 B/W illustrations\n•\tPublished: October 3, 2024",
    "consultation": "請課堂討論或 email 給授課老師 Please discuss in class or email to the professor.",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG6：潔淨水與衛生（Clean Water and Sanitation）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG13：氣候行動（Climate Action）SDG14：水下生命（Life below Water）SDG15：陸域生命（Life on Land）",
    "remarks": "因應疫情將使用 GOOGLE MEET 進行遠距教學 In response to the epidemic, GOOGLE MEET will be used for distance teaching.",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "魏暘",
    "email": "wei38@ntut.edu.tw",
    "latestUpdate": "2024-12-16 16:50:56",
    "objective": "“Natural Biomaterials” is designed to explore the structures, properties, and applications of natural materials in biological systems. Scientists have discovered that natural materials possess outstanding features such as self-repair, antimicrobial properties, and biocompatibility. This course will introduce the latest research developments in natural biomaterials and their applications in engineering fields, including biopolymers, biofabrication, and the potential uses in medical, environmental, and industrial domains. The topics covered in this course will include (1) an overview of natural biomaterials, (2) fundamental building blocks of natural materials, (3) biological functions and applications, and (4) bioinspired and biofabrication technologies.",
    "schedule": "Week 1: Introduction to Natural Biomaterials \nWeek 2: Amino Acids, Proteins, and Polysaccharides: Fundamental Chemistry\nWeek 3: Research Planning and Methodology in Biomaterials Science\nWeek 4: Biofabrication Techniques and Innovative Problem Solving\nWeek 5: Project Management in Biomaterials Research\nWeek 6: Advanced Materials for Environmental and Medical Applications\nWeek 7: Writing Research Papers and Professional Reports\nWeek 8: Midterm Presentation and Feedback Session\nWeek 9: Surface Properties of Natural Biomaterials and Their Applications\nWeek 10: International Trends and Collaboration in Biomaterials Research\nWeek 11: Adhesion Mechanisms in Biomaterials and Their Applications\nWeek 12: Lifelong Learning and Career Development in Chemical Engineering\nWeek 13: Problem-Solving in Biomaterials Engineering\nWeek 14: Managing Research Projects and Teams\nWeek 15: Ethical Implications and Societal Impact of Biomaterials\nWeek 16: Final Research Paper Drafting and Peer Review\nWeek 17: Final Presentation\nWeek 18: Final Exam and Course Reflection",
    "scorePolicy": "1. Class performance/absence 20%\n2. Regular reports 40%\n3. Final reports 40%",
    "materials": "Biological Materials Science: Biological Materials, Bio-inspired Materials and Biomaterials/ M.A. Meyers and P.-Y. Chen. Cambridge University Press. 2014. pp1.630.",
    "consultation": "1. Office hour2.  Line group",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG6：潔淨水與衛生（Clean Water and Sanitation）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG13：氣候行動（Climate Action）SDG14：水下生命（Life below Water）SDG15：陸域生命（Life on Land）",
    "remarks": "We may continuously revise the teaching methods as needed:1. Google Meet will be used for distance learning.2. The course URL will be available on Taipei Tech i-School.3. For inquiries, please contact the teacher at rjchung@ntut.edu.tw or wei38@ntut.edu.tw.",
    "foreignLanguageTextbooks": false
  }
]
