[
  {
    "name": "范書愷",
    "email": "morrisfan@ntut.edu.tw",
    "latestUpdate": "2024-12-18 17:21:44",
    "objective": "本課程旨在概述人工智慧的應用及其對製造業和物流業的影響。 隨機器學習、深度學習、啟發式演算法和其他人工智能方法的發展，相關新興技術的應用越來越多地被應用於製造和物流行業以提高決策能力。本課程將通過介紹人工智慧的基礎知識和實際應用之案例研究闡述使用人工智慧技術對於產業決策之幫助。學生將深入了解人工智慧技術及其在製造和物流領域如需求預測、生產計劃、調度、質量控製或運輸的潛在應用，課程內容亦將應用 ChatGPT 做為開發製造物流問題求解方法之輔助工具。通過本課程，學生將了解人工智慧對製造和物流系統之影響及現況，評估使用人工智慧之益處和局限性，並了解人工智慧對於相關產業之改善。\nThis course provides an overview of AI application and its impact on manufacturing and logistics. Emerging technologies like machine learning, deep learning, heuristics are being utilized to enhance decision-making capabilities. The course covers the fundamentals of AI, practical case studies, and its benefits. Latest AI technologies and their potential applications in manufacturing and logistics such as demand forecasting, production planning, scheduling, quality control, or transportation will be introduced. ChatGPT will be used as an auxiliary tool for developing problem-solving methods. The course develops the ability to analyze the impact of AI on manufacturing and logistics systems, assess benefits and limitations, and evaluate AI improvement for related industries.",
    "schedule": "* AGI\n* AI Landing\n* Digitization\n* Digitalization\n* Digital Transformation\n* Enterprise Intelligentization\n* Green Transition",
    "scorePolicy": "Group Presentation",
    "materials": "Will be disseminated before class",
    "consultation": "1400-1600 on Tuesdays",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG11：永續城市與社區（Sustainable Cities and Communities）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "梁曉帆",
    "email": "maxliang@ntut.edu.tw",
    "latestUpdate": "2024-12-18 14:25:08",
    "objective": "此課程旨在以人因觀點，探討人工智慧跨域製造及物流之應用。",
    "schedule": "Module 1. Human factors\nModule 2. Information display design\nModule 3. Business model",
    "scorePolicy": "50%: Exercises & presentations\n50%: Participation",
    "materials": "自製教材",
    "consultation": "Email: maxliang@ntut.edu.twExt. 2345or contact TA",
    "課程對應SDGs指標": "無（None）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "黃乾怡",
    "email": "jayhuang@ntut.edu.tw",
    "latestUpdate": "2024-12-18 17:15:23",
    "objective": "本課程教導學生對製造業與服務業進行精實化管理的策略與技巧。課程內容包含：造成大型企業倒閉的商務環境改變與組織內的問題；科技提昇與電子化管理對企業的衝擊；精實化企業中有效及具競爭力營運管理的要素；精實化管理的發展策略與技巧。探討競爭優勢與生產服務系統模式、經營模式之關連，包括大量客製化、競爭優勢階段性、 發展競爭優勢作為、 豐富顧客價值。本課程將使學員熟習各項品質管理的理論基礎與發展趨勢，強化理論研究與實務應用能力。首先，課程涵蓋基礎統計使學員具備研究方法與分析技術能力，了解收集、統整和分析資料。其次，討論量化的六標準差管理相關工具及專案推行流程，以系統化思維探討問題並提出有效可行的解決對策，持續提升品質及客戶滿意。最後，介紹制度面及組織管理面的全球品管概念，闡述創造魅力品質之重要理論模型及影響服務品質關鍵因素。\nThis course covers the strategies and techniques of managing a lean business in manufacturing and in service. The linkages between competitive advantages and production systems, competitive advantages and business models will be discussed first. Then, topics include mass customization, competitive advantage stages, developing competitive capability and maximize customer value. This class will help students familiarize themselves with the trend of theoretical basis of the quality management and strengthen their ability in both theoretical research and practical application. First, the course covers basic statistics so that students will be acquainted with research methods and analysis techniques. Second, the six sigma management tools will be reviewed and the process for its implementation will also be addressed. Finally, the system- and the organization-level quality as well as the Kano Model for attractive quality will be discussed.",
    "schedule": "資料探勘技術\n- 資料類型與轉換\n- 資料視覺化\n- 關聯規則\n- 決策樹分析\n- 預測模型評估\n精實系統\n現代品質定義與變異\n6 Sigma 意涵\n二維品質模型（Kano Model）\n品質機能展開（ QFD ）\n失效模式及效應分析 (FMEA)\n量測系統分析 (MSA)\n管制圖 (Control chart)\n製程能力分析 (Cp & Cpk)\n田口品質工程 (Taguchi quality engineering)",
    "scorePolicy": "出席 50%\n報告 50%",
    "materials": "自編教材",
    "consultation": "i school",
    "課程對應SDGs指標": "無（None）",
    "remarks": "google meet",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "鄭麗珍",
    "email": "jessicacheng@mail.ntut.edu.tw",
    "latestUpdate": "2024-12-16 22:07:16",
    "objective": "本課程教授人工智慧技術的基礎理論與實務技巧，並對於人工智慧在製造業、服務業、金融業的應用，提供啟發性的基本認知與創意，以激發學生在人工智慧領域的創新應用。課程內容包括：人工智慧基礎、機器學習、大數據技術、深度學習、生成對抗網路、創業家思維、設計思考、商業模式、人工智慧與現代科技、工業 4.0、人工智慧的製造業應用個案、人工智慧的服務業應用個案、人工智慧的金融應用個案。\nThis course aims to teach students the basic concepts and practical techniques of artificial intelligence and to introduce its applications on manufacturing, service, and finance industries. The course focuses on inspring students for innovative artificial intelligence applications. The course includes: artificial intelligence basics, machine learn-ing, big data, deep learning, generative adversarial network, entrepreneurial thoughts, design thinking, business models, artificial intelligence and modern technologies, industry 4.0, real case applications on manufacturing, service, finance industries.",
    "schedule": "1. 人工智慧簡史\n2. 人工智慧趨勢\n3. 人工智慧與機器學習\n4. 人工智慧與現代科技\n5. 人工智慧的商業模式\n6. 人工智慧個案研讀與討論",
    "scorePolicy": "上課出席，上課參與，分組作業與報告",
    "materials": "上課講義",
    "consultation": "課程 line  群組",
    "課程對應SDGs指標": "SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG17：夥伴關係（Partnerships for the Goals）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
