[
  {
    "name": "王貞淑",
    "email": "wangcs@ntut.edu.tw",
    "latestUpdate": "2025-01-15 16:04:59",
    "objective": "金融科技是近年來新興的產業趨勢，影響的層面非常廣泛，不只是金融方面，更牽涉到新興科技與物聯網。本課程將從不同的角度分析金融科技的技術內容、應用領域及商業模式，並藉由國內外重要金融科技公司發展的經驗做一介紹，希望達到了解並運用此新興科技的目的。本課程內容包括：金融科技概論、金融科技商業模式、金融大數據、P2P 借貸、虛擬貨幣、雲端服務、第三方支付、群眾募資、區塊鏈、跨境電商、程式交易、機器人理財等主題。\nFinTech includes two words: Finance and Technology. It is a new trend of industrial field. It has influences on lots of technical fields, not only finance, but also emerging technologies and IoT. This course will analyze FinTech from different angles, such as technology contents, application fields and business models. It also will utilize experiences of leading companies with FinTech to obtain decent knowledge of this new field. The contents of this course include introduction to financial technology, business models of financial technology, finance big data, P2P lending, virtual money, cloud services, third-party payment, crowd funding, blockchain, cross-border e-commerce, program trading, and robotic financial advisory etc.",
    "schedule": "Weekly Schedule and Course Outline\nWeek 1: Course Overview\n    Introduction to Deep Learning and AI Tools\n    Introduction to Design Thinking\n    Design Thinking and Project Development Process\n    Explanation of Course Grading Rubric\nWeek 2: Data Processing and the KDD Process\n    Overview of the KDD Process\n    Data Processing with Pandas/NumPy\n    Feature Engineering\nWeek 3: Financial Data Analysis and Credit Risk Models\n    Credit Risk Assessment Using Kaggle Datasets\nWeek 4: Fundamentals of Deep Learning\n    Building Simple Neural Networks with Keras/TensorFlow\n    Impact of Hyperparameter Tuning\nWeek 5: Stock Price Prediction Model Development\n    Training and Predicting with Historical Data\n    Gradient Descent Method\nWeek 6: Convolutional Neural Networks (CNN) - Theory and Applications\n    Basic Structure and Implementation of CNN: LeNet, VGG\nWeek 7: Application of CNN in Credit Card Fraud Detection\n    Training Fraud Detection Models Using Kaggle Datasets\n    Discussion on Model Accuracy and Overfitting Issues\nWeek 8: Guest Lecture on AI Applications in Finance\n    Expert Sharing Case Studies\n    Focus on AI Applications in Financial Risk Control to Inspire Project Design\nWeek 9: Project Progress Report and Discussion\n    Group Presentations: \n    Data Sources, Model Strategies, Expected Contributions\nWeek 10: Recurrent Neural Networks (RNN) and LSTM\n    Time Series Data Analysis: Applications of RNN and LSTM\nWeek 11: Application of LSTM in Stock Price Prediction\n    Training LSTM Models for Stock Price Forecasting\nWeek 12: Generative Adversarial Networks (GANs)\n    Structure and Applications of GANs: Data Augmentation, \n    Financial Market Simulation\n    Practical Implementation with PyTorch Model Building\nWeek 13: Deep Reinforcement Learning (DQN)\n    Design and Implementation of Deep Q-Networks (DQN)\n    Software Implementation and Strategy Design\nWeek 14: Model Export and Deployment\n    Cloud Deployment Using TensorFlow Serving\nWeek 15: Summary and Cross-Domain Applications\n    Review and Discussion on Cross-Domain Applications of Deep Learning\nWeek 16: Internal Final Project Presentation\n    Preparation of Final Project Data and Model Design\nWeek 17: External Final Project Presentation\n    Presentation of Project Outcomes and Peer Evaluation\nWeek 18: Course Reflection and Summary\n    Reflection on the Course and Discussion on Future Applications",
    "scorePolicy": "Grade:\n-\tAssignment (Weka, Rapid Miner)  30%\n-\tFinancial Data analytics Project 70%",
    "materials": "rapidminer\nweka\npython",
    "consultation": "wangcs@ntut.edu.tw",
    "課程對應SDGs指標": "無（None）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "范書愷",
    "email": "morrisfan@ntut.edu.tw",
    "latestUpdate": "2024-12-18 17:16:23",
    "objective": "本課程結合設計思考與深度學習技術，專為金融領域應用而設計。學生將學習設計思考的五個核心步驟：同理心、問題定義、創意發想、原型設計和測試，並運用這些步驟解決金融實際問題。課程內容涵蓋數據收集與清洗、特徵工程、深度學習模型構建與訓練，及模型部署與應用。\n學生將使用 Pandas、NumPy、Keras、TensorFlow 等工具，進行數據處理和模型開發，並通過 PBL 項目進行實務操作，體驗跨域合作的過程。\n課程特別強調實務應用，涵蓋信用風險評估、股票價格預測、信用卡欺詐檢測等金融案例。學生將參與多次業界專家分享和企業參訪，了解最新的行業動態和實務經驗。本課程致力於培養具備前瞻性思維、創新能力和實務操作能力的金融科技專業人才。\nThis course combines design thinking and deep learning techniques tailored for financial applications. Students will explore the five key steps of design thinking: empathy, problem definition, ideation, prototyping, and testing. These steps will be applied to solve practical financial challenges.\nThe course content includes data collection and cleaning, feature engineering, deep learning model building, training, and deployment. Students will work with tools like Pandas, NumPy, Keras, and TensorFlow for data analysis and model development. The learning process is enriched through PBL (Project-Based Learning) projects, offering hands-on experience in interdisciplinary teamwork.\nBy integrating technical skills and innovative thinking, this course aims to develop forward-thinking financial technology professionals equipped with practical expertise.",
    "schedule": "* Generative Adversarial Networks;\n* Vision Transformer;\n* Deep Reinforcement Learning\n* Diffusion Models",
    "scorePolicy": "4 Homework Assignments",
    "materials": "Christopher M. Bishop • Hugh Bishop\nDeep Learning\nFoundations and Concepts, Springer\n\nUnderstanding Deep Learning\nSimon J.D. Prince\nOctober 1, 2024",
    "consultation": "Contact CoM Office:1400-1600 on Tuesdays",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
