[
  {
    "name": "陳鴻崑",
    "email": "hkchen@ntut.edu.tw",
    "latestUpdate": "2024-12-16 19:50:14",
    "objective": "This course provides an introduction to the fundamental concepts underlying Environmental, Social, and Governance (ESG) investing. ESG investing, also known as sustainable investing, is an investment strategy that incorporates environmental, social, and governance factors alongside traditional financial analysis in the investment decision-making process. We will begin by exploring ESG factors and examining why they are essential to consider in today's investment landscape. I will present both academic perspectives and practical insights to deepen your understanding of ESG investing. In addition, we will discuss alternative viewpoints to ensure a balanced perspective on this important topic. The scope of this course extends beyond merely ESG investing. In the concluding section, we will pay more attention to the issues of global warming and climate change, which constitute critical components of environmental education. \n\n本課程介紹環境、社會和治理 (ESG) 投資的基本概念。 ESG 投資，也稱為永續投資，是一種在投資決策過程中將環境、社會和治理因素與傳統財務分析相結合的投資策略。我們將首先探討 ESG 因素，並研究為什麼它們在當今的投資環境中至關重要。我將提供學術觀點和實務見解，以加深您對 ESG 投資的理解。此外，我們將討論替代觀點，以確保對這一重要主題的平衡觀點。本課程的範圍不僅限於 ESG 投資。在結論部分，我們將更加關注全球暖化和氣候變遷議題，這是環境教育的重要組成部分。",
    "schedule": "Week 1: Introduction to the course & ESG Investing\nWeek 2: 228 Peace Memorial Day (no classes) \nWeek 3: Introduction to ESG (part 1)\nWeek 4: Introduction to ESG (part 2)\nWeek 5: Introduction to ESG (part 3)\nWeek 6: Why Should We Care ESG? / Assignment #1\nWeek 7: Children’s Day (no classes) \nWeek 8: ESG Investing Beyond Traditional Strategies\nWeek 9: Midterm Exam Week / ESG investing beyond traditional strategies\nWeek 10: Oral presentation #1 (1/3): ESG Investing Textbook\nWeek 11: Oral presentation #1 (2/3): ESG Investing Textbook\nWeek 12: Oral presentation #1 (3/3): ESG Investing Textbook\nWeek 13: Alternative viewpoints on ESG investing (part 1)\nWeek 14: Alternative viewpoints on ESG investing (part 2) / Assignment #3 \nWeek 15: Dragon Boat Festival (no classes) \nWeek 16: Special events: Taiwan Finance Association Annual Meeting at NTNU\nWeek 17: Oral presentation #2: JPM academic paper\nWeek 18: Final Exam Week / Oral presentation #2: JPM academic paper / Assignment #4",
    "scorePolicy": "1. Attendance: 20%\n2. Midterm exam: no, 40%, Replace it with FOUR assignments\n3. Final exam: no, 40%, Replace it with TWO oral presentations, where one is individual report and one is group report.",
    "materials": "Hill, John. Environmental, Social, and Governance (ESG) investing: A balanced analysis of the theory and practice of a sustainable portfolio. Academic Press, 2020 (e-book at NTUT's library).",
    "consultation": "By appointmentOffice: Hong Yu Technology Research Building 638Email: hkchen@ntut.edu.twPhone: +886-27712171#5918",
    "課程對應SDGs指標": "SDG1：消除貧窮（No Poverty）SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
