[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2025-01-02 00:46:29",
    "objective": "我們使用的方塊文字，以形寓意的獨立形構，已是世界文明的獨特瑰寶。本課程將從六書結構、文字流變、文字的文化意涵、文字的藝術觀等四個面向，切入認識中國文字與文化。\n\nThe pictographic system, an independent structure to represent meanings through word forms, has been considered a unique treasure in the world civilization. This course discusses the six morphological structures, the history and development, the cultural representation and the artistic functions of the written words in the Chinese language. \nThis course provides an in-depth exploration of Shuowen Jiezi (說文解字), the foundational dictionary of Chinese characters by Xu Shen (許慎) during the Eastern Han dynasty. Students will study its structure, principles, and influence on Chinese linguistics and culture, gaining insights into character formation and the evolution of Chinese writing.",
    "schedule": "Week 1: Overview of Shuowen Jiezi\nWeek 2: Structure and Methodology\nWeek 3: Radical-based Classification\nWeek 4:Pictographs (象形)\nWeek 5:Ideograms (指事) and Compound Ideograms (會意)\nWeek 6:Phono-semantic Compounds (形聲)\nWeek 7: Semantic Extension (轉注) and Loan Characters (假借)\nWeek 8: Historical Development of Chinese Writing\nWeek 9: Midterm Review & Assessment\nWeek 10: Insights into Ancient Chinese Culture\nWeek 11: Shuowen Jiezi’s Impact on Modern Linguistics\nWeek 12: Case Studies of Key Characters\nWeek 13: Reinterpreting Shuowen Jiezi in Modern Contexts\nWeek 14: Critiques and Limitations of Shuowen Jiezi\nWeek 15: Digital Tools and Resources\nWeek 16: Student-Led Analysis of Chosen Characters\nWeek 17: Review and Reflection\nWeek 18: Final Assessment",
    "scorePolicy": "Participation and Engagement: 20%\nWeekly Assignments: 20%\nMidterm Exam: 30%\nFinal Project and Presentation: 30%",
    "materials": "supplementary materials\n《Shuowen Jiezi》許慎，萬卷樓，2002 年。\n《漢字的故事 China: Empire of Living Symbols》 林西莉，貓頭鷹，2006 年。",
    "consultation": "Email me to get more information：sweetprettylover@gmail.comForeign students or international students welcome to take this course. But please confirm it before taking if your credits are allowed by your department or your school.",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG10：減少不平等（Reduced Inequalities）SDG16：和平正義與有力的制度（Peace, Justice and Strong Institutions）",
    "remarks": "PART 1:Historical Development of Chinese Writing in Week 8 of the course relates to SDG 4 Quality Education and SDG 10 Reduced Inequalities;  Insights into Ancient Chinese Culture in Week 10 of the course relates to SDG 16 Peace, Justice and Strong Institutions.PART 2： Shuowen Jiezi’s Impact on Modern Linguistics in Week 11 of the course is related to the \"Model Learning\" aspect of the 6E method of Innovative Moral Education. Please provide an explanation (for assessment of effectiveness).",
    "foreignLanguageTextbooks": false
  }
]
