[
  {
    "name": "林靜榮",
    "email": "jimcrlin8721@gmail.com",
    "latestUpdate": "2024-12-21 08:38:14",
    "objective": "人工智慧 (AI) 和擴增實境 (AR/VR) 技術已經存在 70 多年；兩者最近都得到了快速發展。 人工智慧在 AR/VR 中有一些常見用途，最典型的例子就是這兩種技術都應用在電玩遊戲。 人工智慧已以多種不同方式應用於視頻，例如世界構建、路徑查找、資料探勘和玩家體驗建模。電玩遊戲是虛擬實境中最受歡迎的應用，主流遊戲中使用的 AI 技術越來越多地應用於 AR/VR 中。\n\n在本課程中，學生將學習如何使用 Unity 3D 建立視訊遊戲應用程序，Unity 3D 是一個功能強大的跨平台 3D 引擎，可提供用戶友好的開發環境。然後學生將學習在 AR/VR 應用程式中使用的人工智慧演算法和工具，例如 ChatGPT、自然語言處理（NLP）、物件辨識等。最後，學生將學習如何使用人工智慧、機器學習和深度學習在 AR/VR 中產生內容，重點是創建環境元素、音樂和其他組件。\n\nArtificial intelligence (AI) and augmented reality/virtual reality (AR/VR) technologies have existed in recognizable form for more than 70 years; both have experienced rapid growth recently. AI has some common uses in AR/VR. The most typical example is that both technologies are used in video games. AI has been applied to video in many different ways, such as world building, path finding, data mining and player experience modeling. One particularly interesting application is the use of AI, machine learning and deep learning for content generation. As video games are the most popular applications in AR/VR, AI technology used in mainstream games is increasingly being used in AR/VR.\n\nIn this course, students will learn how to build video game applications using Unity 3D, a powerful cross-platform 3D engine that provides a user-friendly development environment. Students will then learn AI algorithms and tools used in AR/VR applications, such as ChatGPT, natural language processing (NLP), object recognition, etc. Finally, students will learn how to use artificial intelligence, machine learning, and deep learning to generate content in AR/VR, with a focus on creating environmental elements, music, and other components.",
    "schedule": "Week\tDate\tClass\tDeadlines\n1\t2/21\tIntroduction to VR/AR/XR\t\n2\t2/28\tHoliday\t\n3\t3/7\tLecture 1: A Brief Introduction to the Virtual World 1\tProject 1 Description release \n\n4\t3/14\tLecture 2: Getting Set Up for Unity \tProject 1 Finish \nProject 2 Description release\n5\t3/21\tLecture 4: The Unity VR Project Setup\tProject 2 Finish\nProject 3 Description release\n6\t3/28\tLecture 5: The Unity VR Interaction System\tWork on project 3\n7\t4/4\tHoliday\tProject 3 Finish\nMid-term Project Description release\n8\t4/11\tLecture 6 : VR Optimization and Lighting\tProject 3 Present and Demo\n9\t4/18\tMid-term\tWork on mid-term project\n10\t4/25\tLecture 7: AR Introduction\nProject 3 Present and Demo\tMid-term Project Present/Demo\nProject 4 Description release\n11\t5/2\tLecture 8: AR Development\nMid-term Project Present/Demo\tFinal Project Description release\n12\t5/9\tLecture 9:  AI in Virtual Reality\tProject 4 Finish and Demo\nFinal Project Proposal due\n13\t5/16\tLecture 10: Unity AI: ML Agent\tFinal Project Discussion\n14\t5/23\tLecture 10: Unity AI: ChatGPT\tFinal Project Discussion\n15\t5/30\tLecture 11: : Unity AI: NLP\tFinal Project Finish and Demo\n16\t6/6\tFinal Summary and Discussion\t\n17\t6/13\tFinal Project Presentation",
    "scorePolicy": "• Individual Assignment/Project (40%)\no (10%) Project #1\no (10%) Project #2\no (10%) Project #3\no (10%) Project #4\n• Mid-Term Project (15%)\n• Team/Final Project (35%)\no (5%) Project proposal\no (5%) Project mid-term report\no (5%) Project presentation\no (20%) Project final report\n• In-Class Activity (10%)",
    "materials": "Steven M. LaValle. Virtual Reality. To be published by Cambridge University Press. (available online: http://lavalle.pl/vr/ )",
    "consultation": "Email to jimcrlin8721@gmail.com",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG17：夥伴關係（Partnerships for the Goals）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
