[
  {
    "name": "陳雅玫",
    "email": "ymchen@ntut.edu.tw",
    "latestUpdate": "2024-09-05 13:56:37",
    "objective": "This course introduces various translation practices in the digital age and familiarizes students with appropriate translation methods and strategies. In the first part of the course, students will gain an understanding of online collaborative translation, translation crowdsourcing, fansubbing, and video game translation. In the second part, students will participate in two authentic online translation projects: Global Voices Lingua and Wikipedia translation. For the former, students will collaborate with the Lingua project's Chinese editors to produce Chinese translations of citizen news posts for publication on Global Voices. For the latter, students will engage in Wikipedia translation in various forms to develop their individual and social metacognition related to translation and enhance their ability to handle the translation of various text types. Students’ active engagement in project-based tasks is critical to this course. This involvement provides them with fundamental skills and keeps them current on newly-emerged translation practices.",
    "schedule": "Week 1 introduction/transcreation: advertisement translation\nWeek 2 mid-Autumn festival\nWeek 3 transcreation: video game translation \nWeek 4 tourism translation (1)\nWeek 5 tourism translation (2) \nWeek 6 translation crowdsourcing and online collaborative translation; Global Voices Lingua \nWeek 7 fansubbing (1)\nWeek 8 fansubbing (2)\nWeek 9 Wikipedia Translation Project 1: current event topics \nWeek 10 Wikipedia Translation Project 1: current event topics\nWeek 11 Wikipedia Translation Project 1: current event topics \nWeek 12 Wikipedia Translation Project 2 (with collaboration scripts): cultural and artistic topics\nWeek 13 Wikipedia Translation Project 2 (with collaboration scripts): cultural and artistic topics\nWeek 14 Wikipedia Translation Project 2 (with collaboration scripts): cultural and artistic topics\nWeek 15 Wikipedia Translation Project 3 (with ChatGPT): lifestyle and leisure topics\nWeek 16 Wikipedia Translation Project 3 (with ChatGPT): lifestyle and leisure topics\nWeek 17 Wikipedia Translation Project 3 (with ChatGPT): lifestyle and leisure topics\nWeek 18 Wrap up; Survey of students’ perception of collaboration scripts and ChatGPT",
    "scorePolicy": "1. Continuous assessment (attendance, participation, pre-readings): 25% \n2. Two translation tasks: 30%\n    (1) Tourism translation task\n    (2) Fansubbing task\n3. Thr ee Wikipedia translation projects: 45%",
    "materials": "Research Participation: The second part of this course (i.e., the three Wikipedia translation projects) involves participation in a research study that examines the effects of collaboration scripts and AI tools on translation processes and outcomes. During Week 9, students will be fully informed about the research objectives, methods, and their rights as participants. Participation in the research is voluntary and will not affect course grades. Students who choose not to participate in the research will still complete all course activities, but their data will not be included in the study.",
    "consultation": "ymchen@mail.ntut.edu.tw",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
