[
  {
    "name": "林筱玫",
    "email": "lydia.hmlin@gmail.com",
    "latestUpdate": "2024-05-27 15:25:21",
    "objective": "本課程旨在以專題設計方式，訓練學生確認並建立需求、發展設計選擇方案、製作設計的互動形式、設計評估的專業知能，並以設計專案方式演練完整之設計過程。學生經由分組合作或獨自創作完成一媒體設計主題。上學期課程以題目釐定、資料蒐集、分析調查、設計定義、構想發展、程式設計、雛型製作等活動為教學內容；下學期則進行觀察測試、使用性評估、程式調校、專刊編輯、展示佈置以及設計報告提交等為教學內容，以培養學生具備互動設計專題製作之專業知能。\nThrough project design, the course prepares students to confirm the needs of design, develop alternatives of media design projects, create interactive modes, and evaluate design performance through independent study or cooperative learning. In the first semester, learning materials of the course include subject clarification, data collection, analysis and investigation, design definition, concept development, programming, and prototyping. In the second semester, learning materials of the course include observation and testing, usability evaluation, programming debug, report editing, exhibition and design report submission. Accordingly, students will be ready for professional competencies of interaction design projects.",
    "schedule": "1. 課程規劃說明\n2. 分組討論\n3. 分組討論\n4. 【共評一】設計構想提案發表\n5. 分組討論\n6. 分組討論\n7. 分組討論\n8. 分組討論\n9. 【共評二】設計進度發表\n10. 分組討論\n11. 分組討論\n12. 分組討論\n13. 分組討論\n14.【共評三】設計進度發表\n15. 分組討論\n16. 分組討論\n17. 分組討論\n18.【期末總評日】互動技術操作與展示",
    "scorePolicy": "共評一～共評三\t60%\n期末總評日\t25%\n出缺勤表現與貢獻度\t15%",
    "materials": "NO",
    "consultation": "課程諮詢管道\t小組指導聯繫帳號：開課時建立 Line 群組課程主持人聯繫帳號:https://www.facebook.com/berrymeiLine ID: hmlin546018 教師學校 Gmail 信箱帳號: Lydia@mail.ntut.edu.tw 教師個人 Gmail 信箱帳號: Lydia.HMLIN@gmail.com",
    "remarks": "課程諮詢管道\t小組指導聯繫帳號：開課時建立 Line 群組課程主持人聯繫帳號:https://www.facebook.com/berrymeiLine ID: hmlin546018 教師學校 Gmail 信箱帳號: Lydia@mail.ntut.edu.tw 教師個人 Gmail 信箱帳號: Lydia.HMLIN@gmail.com",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "莊育鯉",
    "email": "chuang.yuli@gmail.com",
    "latestUpdate": "2024-05-23 20:02:22",
    "objective": "本課程旨在整合應用程式與設計，完成具互動性的視覺傳達設計作品。為達成此目標，本課程培養學生熟悉與整合互動設計的理論、方法與應用，以具互動性的視覺設計議題，訓練學生獨立創作或分組合作設計，藉此訓練學生創意思考、應用科技與新知的實作能力，同時也可結合產學合作專案於教學活動內，達到務實致用的目標。\nThis course applies design and programming into interaction design projects relating to visual communication design. To achieve this goal, students will familiarize the theories, methodology and implications of visual communication design in this course. By interaction design issues, students create and implement ideas by brainstorming through independent study or cooperative learning. For competition without any gap, industry-academic cooperation is one way to prepare student’s critical competencies same as the desired competencies required by the industry.",
    "schedule": "01 緒論、課程介紹 \t學生需求瞭解\t\n02 主題企劃\t分組討論\t\n03 初步專案構想\t分組討論\t\n04 資料蒐集與分析\t分組討論\t\n05 技術可行性分析\t分組討論\t\n06 專案企劃文本\t分組討論\t\n07 專案情境應用模擬 1\t分組討論\t\n08 專案情境應用模擬 2\t分組討論\t\n09 專案內容分析 1\t分組討論\t期中考週\n10 專案內容分析 2\t分組討論\t\n11 情境劇本設計\t分組討論\t\n12 故事分鏡圖設計\t分組討論\t\n13 故事分鏡圖製作\t分組討論\t\n14 專案製作 protype1\t分組討論\t\n15 專案製作 protype2\t分組討論\t\n16 專案製作 protype3\t分組討論\t\n17 專案整合與測試\t分組討論\t\n18 【期末發表】\n期末成果：含完整劇本、情境模擬、展示雛形機台\t各組發表\t期末考週",
    "scorePolicy": "1 期末發表 (光華館四樓)& 發展過程 (e-portfolio)\t60%\n2 出缺勤表現\t10%\n3 指導老師評分\t30%",
    "materials": ".",
    "consultation": ".",
    "remarks": ".",
    "foreignLanguageTextbooks": false
  }
]
