[
  {
    "name": "高荻華",
    "email": "carlo123@gmail.com",
    "latestUpdate": "2024-09-07 19:23:28",
    "objective": "本校科技大學的國文課程，以能力及素養之培植為導向， 並以精深致用為授課標的，方能不負大學國文課程之名， 並符合本校重視實務應用的優良傳統。 依授課教師之取擇，課程可概分為兩大類。 一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。 二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。 期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.",
    "schedule": "週次\t日期  \t主題 Topic\t       單元主題 Unit\n1\t09/09\t課程介紹\t                課程介紹\n2\t09/16\t自我：傾聽內在\t論孟選讀\n3\t09/23\t自我：傾聽內在\t論孟選讀\n4\t09/30\t自我：傾聽內在\t論孟選讀\n5\t10/07\t自我：傾聽內在\t論孟選讀\n6\t10/14\t自我：傾聽內在\t分組報告 1〈水鬼城隍〉\n7\t10/21\t人我：生命交會\t分組報告 2〈穿母親買的衣服〉\n8\t10/28\t人我：生命交會\t電影欣賞：深夜加油站遇見蘇格拉底\n9\t11/04\t期中考\t\n10\t11/11\t人我：生命交會\t分組報告 3〈我們看菊花去〉＋\n                                                                         〈第六隻手指〉\n11\t11/18\t人我：生命交會\t分組報告 4〈惡之幸福〉\n12\t11/25\t人我：生命交會\t分組報告 5〈人環〉\n                                                                         （含〈陽羨書生〉）\n13\t12/02\t人我：生命交會\t電影教學《鄉村・臉龐》\n14\t12/09\t物我：永續創新\t分組報告 6〈蘋果的滋味〉〉\n15\t12/16\t物我：永續創新\t分組報告 7〈論牛肉麵〉\n16\t12/23\t物我：永續創新\t分組報告 8〈人與病原，終無寧日〉\n17\t12/30\t\t                        課程總結\n18\t01/06\t期末考",
    "scorePolicy": "（一）\t作業 35%：請依規定格式、日期繳交，抄襲（超過 50 字雷同）一律零分，引用需註明出處。\n（二）\t課堂報告及心得 35% \n（三）\t平時成績 10%：含上課出席率、課堂參與、討論發言、上課態度\n（四）\t會考成績 10%\n（五）\t書香計畫 10%\n\n＊因授課需求或學校要求可能微幅調整，授課老師保有最終決定權。",
    "materials": "自製講義",
    "consultation": "fay-1207@yahoo.com.tw 或 teams 訊息留言",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG5：性別平等（Gender Equality）SDG10：減少不平等（Reduced Inequalities）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG17：夥伴關係（Partnerships for the Goals）",
    "remarks": "使用 teams 線上教學，報告、心得與期末作業均改為 teams 繳交。一切課程相關均以 teams 為基本平台。",
    "foreignLanguageTextbooks": false
  }
]
