[
  {
    "name": "楊雅婷",
    "email": "M111097010@TMU.EDU.TW",
    "latestUpdate": "2024-07-17 18:36:25",
    "objective": "本文化生活美學發展專題課程因應主授教師專業背景及業界經驗，目標帶給同學們一同探索文化生活美學過程，展開如何開啟個人生涯規劃價值與事業發展助益之旅，並著重於與同學們一同了解及感悟文化生活美學過程，對個人事業及生活發展具有幫助，能於學習過程中發現與精煉個人美學天賦或美學智慧，並能將之創造並回饋應用於自己的事業及生活中，本課程將邀請文化生活美學典範人物分享與場域踏查體驗過程，帶領同學於過程中進行文化生活美學洞察，並能有機會具體應用於自己的生活及事業中。\n\nThis special course on the development of cultural life aesthetics is based on the professional background and industry experience of the main teacher. The goal is to bring students to explore the process of cultural life aesthetics and how to start a journey of personal career planning value and career development assistance and focuses on working with students. Understand and appreciate the aesthetic process of cultural life together, which is helpful for personal career and life development. You can discover and refine your personal aesthetic talent or aesthetic wisdom in the learning process and be able to create and feedback it and apply it to your own career and life. The course will invite models of cultural life aesthetics to share and experience the process of field investigation, leading students to gain insight into cultural life aesthetics during the process and have the opportunity to apply it to their own lives and careers.",
    "schedule": "第 01 周 課程簡介\n第 02 周 文化創意美學概論 I\n第 03 周 文化創意美學概論 II\n第 04 周 視覺傳達設計產業\n第 05 周 產品設計產業\n第 06 周 設計品牌時尚產業\n第 07 周 建築設計產業\n第 08 周 創意生活產業\n第 09 周 表演藝術產業\n第 10 周 會展產業\n第 11 周 動畫與數位內容產業\n第 12 周 永續及健康產業\n第 13 周 地方創生與社會設計\n第 14 周 文化創意美學產業的未來\n第 15 周 文創智財法律與藝術授權\n第 16 周 文創產業資源整合應用\n第 17 周 期末報告\n第 18 周 期末報告 \n\n※本課程將因應典範人物分享或場域參訪調整授課內容或時間，主授教師將視師生學習進行最適配安排。\n\nWeek 01 Course Introduction\nWeek 02 Introduction to Cultural and Creative Aesthetics I\nWeek 03 Introduction to Cultural and Creative Aesthetics II\nWeek 04 Visual Communication Design Industry\nWeek 05 Product Design Industry\nWeek 06 Design Brand Fashion Industry\nWeek 07 Architectural Design Industry\nWeek 08 Creative Life Industry\nWeek 09 Performing Arts Industry\nWeek 10 Exhibition Industry\nWeek 11 Animation and Digital Content Industry\nWeek 12 Sustainability and Health Industry\nWeek 13 Place Creation and Social Design\nWeek 14 The future of cultural, creative and aesthetic industries\nWeek 15 Cultural and Creative Intellectual Property Law and Artistic Licensing\nWeek 16 Integration and application of cultural and creative industry resources\nWeek 17 Final Report\nWeek 18 Final Report\n\n※This course will adjust the teaching content or time according to the sharing of role models or field visits. The teaching teacher will make the most appropriate arrangement based on the learning of teachers and students.",
    "scorePolicy": "出席率與課堂互動 50%\n課程心得分享 20%\n課程作業與期末報告 30%\n課程表現優異加分 10%\n(課堂或課外對文化生活美學感悟或實踐行動分享)\n\nAttendance and class interaction 50%\nCourse experience sharing 20%\nCoursework and final report 30%\n10% extra points for excellent course performance\n(Sharing of cultural life aesthetic insights or practical actions in class or extracurricular)",
    "materials": "《哈佛商學院的美學課》 寶琳・布朗著、謝樹寬翻譯\n《哈佛創意美學課：鍛鍊商業美學力，打造改變世界的暢銷商品》大衛・艾德華斯著、許玉意翻譯\nCreating Things That Matter: The Art and Science of Innovations That Last. David Edwards\nAesthetic Intelligence. Pauline Brown",
    "consultation": "電子郵件：m111097010@tmu.edu.twLINE 帳號：taipei101_q 加入帳號請自我介紹，萬分感謝！Email: m111097010@tmu.edu.twLINE account: taipei101_q Please introduce yourself to join the account, thank you very much!",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "※本課程將因應典範人物分享或場域參訪調整授課內容或時間，主授教師將視師生學習進行最適配安排。 ※This course will adjust the teaching content or time according to the sharing of role models or field visits. The teaching teacher will make the most appropriate arrangement based on the learning of teachers and students.",
    "foreignLanguageTextbooks": true
  }
]
