[
  {
    "name": "陳正中",
    "email": "chenjengchung@gmail.com",
    "latestUpdate": "2024-05-27 07:48:42",
    "objective": "本課程在二技為品質管理。使學生瞭解品質管理的觀念、原理、領域。品管部門的組織、功能，如何管理產品或服務的品質，品管的工具、方法，如何持續改善品質的方法，品質表示法，如何評估品質管理成效，相關法令，品質管理未來趨勢。\nThis course lets the students understand the concepts, theories, and areas of qualify control, organization and functions of quality department.  Besides, the way to manage the products or the service quality, tools and methods of quality control, the way to improve the quality, quality representation method, evaluation of quality control, related regulations and future trends are also included.",
    "schedule": "Topic-1 服務品質管理介紹\nTopic-2 服務系統之運作及品質量測\nTopic-3 改善服務品質的工具",
    "scorePolicy": "平時成績 (含出席、課堂表現及作業) 20%\n期末考 30%",
    "materials": "李友錚，賀力行 (2010)，品質管理：整合性思維 (第三版)， 前程文化\n顧志遠與薄榮薇 (2012), 服務業─系統設計與作業管理，華泰書局",
    "consultation": "Email: chenjengchung@gmail.comLine ID: 0936946023",
    "課程對應SDGs指標": "SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "若授課方式改線上教學，則以 Microsoft Teams 作為線上教學用軟體，期中、期末報告以線上方式進行。",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "黃乾怡",
    "email": "jayhuang@ntut.edu.tw",
    "latestUpdate": "2024-09-30 10:55:56",
    "objective": "This course enables students to understand the concepts, principles, and domains of quality management. It covers the organization and functions of the quality management department, how to manage the quality of products or services, quality management tools and methods, methods for continuous quality improvement, quality representation methods, how to evaluate the effectiveness of quality management, relevant regulations, and future trends in quality management. The course content includes quality responsibility, total quality management, basic statistics, control charts, probability theory, attribute control charts, acceptance sampling, reliability, and more.",
    "schedule": "Chapter 1- Modern Quality Management and Improvement\nChapter 2- The DMAIC Problem Solving Process\nChapter 3- Statistical Models or Quality Control and Improvement\nChapter 4- Statistical Inference in Quality Control and Improvement\nChapter 5- How SPC Works\nChapter 6- Variables Control Charts\nMidterm exam\nChapter 7- Attributes Control Charts\nChapter 8- Determining Process and Measurement Systems Capability\nChapter 9- Time-Weighted Control Charts\nChapter 13- Basic Experimental Design for Process Improvement\nChapter 15- Basic Acceptance sampling Procedures\nFinal exam",
    "scorePolicy": "midterm 30%, final exam 40%, attendance and particiation 30%",
    "materials": "Statistical Quality Control – A Modern Introduction; by D. Montgomery 東華書局 新月圖書",
    "consultation": "class line groupIMPORTANT ANNOUNCEMENT！！！The class time has been reschedule to Wednesday 9:10am~12:00. If you have any question, please contact Professor Huang through email: jayhuang@mail.ntut.edu.tw",
    "課程對應SDGs指標": "無（None）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
