[
  {
    "name": "夏至賢",
    "email": "chhsia625@gmail.com",
    "latestUpdate": "2024-07-22 00:51:25",
    "objective": "In recent years, advancements in multimedia technology have made it a challenging and interdisciplinary field of research, encompassing areas such as computer science, communications, physics, mathematics, engineering, and the humanities and social sciences. The challenges and goals of information technology in the 21st century will focus on the diversification and plurality of multimedia content, intelligent applications and services, and interdisciplinary integration. Considering this, the course aims to cultivate students’ understanding of multimedia technology and its applications, exploring the integration of the Internet and embedded systems. Students will learn multimedia systems' design principles and standards, enabling them to create multimedia products an extend to emerging applications of integrated multimedia information systems. The course covers a wide range of topics including an introduction to multimedia, text media, audio media, image media, video media, web media, animation media, virtual reality, internet of things, biological information systems, training in innovative thinking, and various other technologies and their applications.",
    "schedule": "Introduction to multimedia, text media, audio media, image media, video media, web media, animation media, virtual reality, internet of things, biological information systems, and training in innovative thinking.",
    "scorePolicy": "1. Homework: 30%\n2. Participation: 10%\n3. Proposal: 30%\n4. Final Project: 30%",
    "materials": "Jennifer Burg, The Science of Digital Media, Pearson Prentice Hall, Inc., 2010.",
    "consultation": "At the Dept. IxD office.",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "The course is only available to international students in this department.",
    "foreignLanguageTextbooks": true
  }
]
