[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2024-06-04 22:20:59",
    "objective": "本課程主要在於介紹產品環保化設計的概念與實務做法，將會詳細介紹生命週期評估的內涵與原理做法，並將透過軟體的實際作來學期如何從事產品的生命週期評估。簡化式的生命週期評估之作法也會在課堂中被介紹。\nTo understand how Life Cycle Thinking and Life Cycle Management can solve environmental problems. Life Cycle Assessment (LCA), one of the most important tools for analyzing and assessing environmental problems, will be taught during the course of the semester. Students will also be learning a popular LCA software, SimaPro. Various applications related to LCA, such as carbon footprinting, carbon labeling, and eco-design, will also be practiced in the class.",
    "schedule": "Week 1\tIntroduction of Life Cycle Assessment I: History, Development, and Applications\nWeek 2\tIntroduction of Life Cycle Assessment II: Life Cycle Thinking and Life Cycle Management\nWeek 3\tMethodology of LCA: I. Goal and Scope Definition and inventory analysis\nWeek 4 \tMethodology of LCA- II. Inventory analysis\nWeek 5\tNational Holiday (no class)\nWeek 6\tLCA Software SimaPro: Introduction and Practices (Make learning groups)\nWeek 7\tMethodology of LCA- III. Methodology of LCIA\nWeek 8\tMethodology of LCA- IV. Uncertainty, sensitivity analysis, and interpretation\nWeek 9\tMid-term Exam\nWeek 10\tGroup report- LCA for one product or service \nWeek 11\tLCA Applications(I): Product and Process Ecodesign; Environmental Declarations and Carbon Labeling, etc.\nWeek 12\tLCA Applications(II): Environmental Engineering Related Applications\nWeek 13\tOther Types of LCA (Eco-efficiency, MFCA, Social LCA, and Organizational LCA, etc.)\nWeek 14\tSpecial Topic: CBAM and Carbon Footprint, Water Footprint, and Environmental Footprint\nWeek 15\tLCA Outlook and Latest Development: Net Zero and Biodiversity; Natural Capital Accounting\nWeek 16  Team Project Presentation I.\nWeek 17  Team Project Presentation II.\nWeek 18  Final Exam",
    "scorePolicy": " Participation and Homework：30 %   Exams：30 %\n Team Project (Report and Oral Presentation)： 40 %",
    "materials": "Hauschild, M.Z., Rosenbaum, R.K., & Olsen, S.I.(eds.) (2018). Life cycle assessment: Theory and Practice (Vol. 2018). Springer International Publishing, Cham. https://doi. org/10.1007/978-3-319-56475-3\nJolliet, O. et al., Environmental Life Cycle Assessment, CRC Press, 2016\nBaumann, H. and A.-M. Tillman, The Hitch Hiker’s Guide to LCA- An Orientation in Life Cycle Assessment Methodology and Application, Studentlitteatur AB, 2004\n\n*Resources link：\thttps://www.lifecycleinitiative.org",
    "consultation": "Office Hour: Wednesday afternoon 14:00~16:00Or Make an appointment with Prof. HU: Ext. 4151 or allenhu@mail.ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
