[
  {
    "name": "張素薰",
    "email": "shchang@ntut.edu.tw",
    "latestUpdate": "2024-05-22 12:05:37",
    "objective": "本課程旨在進一步加強學生的口語表達溝通之能力。經由合宜的活動設計，如小組討論，與英語談話情境的塑造，如面談，學生將獲得充分機會以演練聽講的技巧。\nThis course is designed to develop oral communication skills at a higher level. Stimulated theme-based scenarios and authentic content will be used to engage students with the purpose of generating lively conversation, and video films. Activities include task-based pair and small-group discussion for maximum practice and personalization.",
    "schedule": "I.\tThe Syllabus for 4E2 English Conversation, 2023 (1) \n    一一三學年度第一學期\nWeek\tTopics\tSpeaking Skills\n1 \tIntroduction\n2 \tUnit 1 \nThe Influences of Global Climate\tMake a good start\n\n3 \tUnit 2\nLive to Eat, or Eat to Live \tStructure your speech\n4 \tUnit 3\nThe Effects of Covid-19 on Societies and Economies\tFind the right tone\n5 \tDouble Tenth Holiday\t\n6 \tUnit 4\nThe Changes of Family\tUse gestures\n7 \tPresentation and Acting: “Family faces are magic mirrors. Looking at people who belong to us, we see the past, present, and future”, Interpret the implication of the statement (For example: Looks and habits can be inherited; your grandpa’s face is like your past. Or we use the way we grew up to raise our children; we unconsciously repeat the history of our past. Group work, 16-20 minutes.)\n8 \tUnit 5\nThe Secrets of a Very Long Life\tMaintain eye contact while presenting \n9 \tUnit 6\nSocial Media and Mental Health\tAvoid filler words\n10\tUnit 7\nShould the Olympics be Abolished?\tCope with stage fright\n(Assignment of W10 will be presented at W12)\n11\tPresentation: an in-depth analysis of a piece of news or events concerning the topics of this semester, group work, 16-20ms \n12 \tUnit 8\nThe Differences Between Eastern and Western Education\tUse articulation, pitch and rate \n13 \tUnit 9\nCities and Urbanization\tEngage with the audience\n\n14\tUnit 10\nConsumerism\tPresent an effective end\n15 \tUnit 11\nThe Jobs in the 21st Century\tUse different types of media\n16 \tPresentation: An introduction to a special travel with the sense of globalization (that is concerned about education,  urbanization, consumerism, and the jobs in the 21st century), individual work, 4-5ms\n17 \tFounding Day\n18 \tFinal Report + Group meeting",
    "scorePolicy": "II. Evaluation\n1.\tWeekly Tests (vocabulary test 30% +written assignment 30%, speaking assignment 40%) and Attendance (-2 for each absence, one chance for deletion). 70%\n2.\tIndividual and Group Presentations. 30%\n\nIII. Evaluation for Home Quarantine\n1.\tWeekly Test (weekly test, 20%, written assignment 30% + individual videotape 50%) 70%\n2.\tPresentations and Final Report. 30%",
    "materials": "handout",
    "consultation": "IV. The way to get into contact with the teacher1.\tTeacher’s e-mail: shchang@ntut.edu.tw2.\tHandout: https://drive.google.com/drive/folders/1VF-z37ULbxyHZQnQzaooR5woO0h16S4_?usp=sharing",
    "課程對應SDGs指標": "SDG1：消除貧窮（No Poverty）SDG3：良好健康和福祉（Good Health and Well-being）SDG4：優質教育（Quality Education）SDG5：性別平等（Gender Equality）SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG10：減少不平等（Reduced Inequalities）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG12：負責任的消費與生產（Responsible Consumption and Production）SDG13：氣候行動（Climate Action）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
