[
  {
    "name": "羅元隆",
    "email": "yllo@ntut.edu.tw",
    "latestUpdate": "2024-05-26 11:21:48",
    "objective": "This course is designed as the precursor course selected by seniors and graduate students. It covers the basic knowledge of the atmospheric boundary layer, bluff-body aerodynamics, aero-elasticity, the wind-resistant design of buildings, and the concept of wind-resistant design of bridges. National and international wind codes for buildings and bridges are introduced with practices based on wind tunnel test data. Other related wind issues are also conceptually introduced in this course.",
    "schedule": "W01/Introduction\nW02/Atmospheric Boundary Layer\nW03/Basic Design Wind Speed\nW04/Bluff-Body Aerodynamics\nW05/Review of Dynamics of Structures I (SDOF)\nW06/Review of Dynamics of Structures II (Gnenralized Sys)\nW07/Review of Spectral Analysis I (SDOF)\nW08/Review of Spectral Analysis II (Gust Loading Factor)\nW09/Mid-term Exam (Written Test)\nW10/Wind Tunnel Visiting (Tamkang University)\nW11/Wind-Resistant Design of Tall Buildings I (Overall forces)\nW12/Wind-Resistant Design of Tall Buildings II (Calddings)\nW13/Wind-Resistant Design of Tall Buildings III (Human comfort)\nW14/Wind-Resistant Design of Tall Buildings IV (Environmental flow)\nW15/Wind-Resistant Design of Bridges I\nW16/Wind-Resistant Design of Bridges II\nW17/Other Wind-related Issues\nW18/Final Exam (Final Report Submission)",
    "scorePolicy": "Attendance 20%\nMid-term Exam 30%\nAssignment 30%\nFinal Report 20%",
    "materials": "1. Winds Effects on Structures: Fundamentals and Applications to Design, E. Simiu and R.H. Scanlan, Wiley-Interscience, 1996, 3rd Edition.\n2. Wind Loading of Structures, John D. Holmes, CRC Press, 2015, 3rd Edition.",
    "consultation": "During the semester, a LINE group of this course will be set up for free and quick discussion. If any student wants to discuss specific content in person, an advance email shall be sent to the lecturer to confirm the appointment time.",
    "remarks": "@Language：English@Face-to-face lecturing and one-time lab visiting; however, it is possible to have online meetings for lectures if the university requires. (Link：https://meet.google.com/tyo-wjvn-abf)@Evaluation: Attendance, Assignments, Written exams, and Report submission.@Materials can be downloaded via iClass.@Students can contact the lecturer for questions via yllo@mail.ntut.edu.tw.",
    "foreignLanguageTextbooks": true
  }
]
