[
  {
    "name": "林益辰",
    "email": "iclin@ntut.edu.tw",
    "latestUpdate": "2024-05-22 11:25:40",
    "objective": "本課程旨在提升管理決策之心智、理論與技能，並在複雜企業環境下的實務管理決策案例分析應用，使了解在國際環境中科技進展及應用下，如何透過各種決策模式了解並分析複雜情境，達成經濟及有效的管理決策。另一方面，透過了解、認同領導統御的理念、特質及行為，建立學生全面性的傑出領導素養。\nThis course covers theoretical knowledge and practical skills providing the ability to develop managerial decisions based on the application of various methods in the international environment, including: studying and analyzing the process of making economic and managerial decisions. In the same time, this course is designed to provide a basic introduction to leadership by focusing on what it means to be a good leader. Emphasis in the course is on the practice of potential philosophy of leadership, traits, skills, behaviors, and develop students a great overall leadership proficiency.",
    "schedule": "Week1-2: How perception influences our understanding of DM/leadership\nWeek3-4: Changing paradigms of leadership history/thoughts\nWeek5-6: The “Decision Architect”, responsive and decisive leadership\nWeek7-8: Personality, leadership style and decision-making activity\nMidterm\nWeek10-11: A systematic, mechanistic and structured approach to DM\nWeek12-13: Emotional Intelligence, collaborative practice and decision making\nWeek14-15: Critical Thinking Definitions,Barriers and Models \nWeek16-17: Recognizing and Overcoming Bias in DM/leadership\nWeek18: Final",
    "scorePolicy": "Oral/team report: 25%\nMidterm: 25%\nFinal: 25%\nClass participation/involvement: 25%",
    "materials": "1. Bazerman, M.H. and Moore, D.A. (2013), Judgment in Managerial Decision Making, 8th ed. New York: Wiley.\n2. Kahneman, D., Sibony, O., & Sunstein, C. R. (2021). Noise: A flaw in human judgment. Little, Brown Spark.\n3. Bazerman, Max. (2014). The power of noticing: What the best leaders see. New York: Simon & Schuster.\n4. The required readings that I posted on NTUT Teams",
    "consultation": "iclin@ntut.edu.tw 科技大樓 1130",
    "remarks": "必須加入課程 Teams",
    "foreignLanguageTextbooks": false
  }
]
