[
  {
    "name": "陳靜儀",
    "email": "cic@ntut.edu.tw",
    "latestUpdate": "2024-05-30 12:55:00",
    "objective": "UX（User Experience）使用者經驗設計師，是一種特別需要橫向與縱向技能的設計師。本課程從物件 (objects) 、流程 (processes)、體驗 (experiences)、敘事 (narratives) 四個不同的脈絡切面，讓學生了解使用者經驗設計師的必備知識、技能與工具，並包含實體 / 數位產品與服務範疇。並隨著生成式 AI 的趨勢，介紹生成式 AI 如何輔助 UX 設計師進行使用者研究與設計。同時，培養學生未來能在特定專業領域持續發展使用者體驗設計師職能的視野和態度，以及 UX 設計師在職場上的角色定位。\n學生將學會結合使用者研究的質性和量化方法及其工具來塑造實體與數位產品或服務的資訊架構。此外，他們將掌握如何利用簡報和視覺化溝通來促進組織內的設計決策。課程將涵蓋 UX、LEAN UX、Agile UX 與 Scrum 等不同設計開發流程的實踐。學生也會學習 Prototype 設計規劃與實施易用性測試，使用實體與遠端工具。課程中也將介紹如何運用生成式 AI 輔助 UX 研究與設計。\nUX (User Experience) designers require both broad and specialized skills. This course provides students with a comprehensive understanding of the necessary knowledge, skills, and tools for UX designers through the context of four different aspects: objects, processes, experiences, and narratives. Students will learn to integrate qualitative and quantitative user research methods and tools to shape the information architecture of both physical and digital products or services. Additionally, they will master how to use presentations and visual communication to facilitate organizational design decisions. The course covers practical processes of various design development workflows, such as UX, LEAN UX, Agile UX, and Scrum. Students will also learn prototype design planning and how to conduct usability testing with both physical and remote tools. The course will also illustrate the use of generative AI in assisting UX research and design.",
    "schedule": "W01: 課程介紹；UX 設計師到底在做什麼？\n- 課程內容介紹與學習規範\n- 國內外人力銀行上徵求「UX 設計師」的職務內容和技能與其差異\n- 此職業在近幾年的變化\n- 工業設計師、產品設計師、與使用者體驗設計師？\n- 使用者經驗與服務設計的異同\n- 自身過去實務上的經驗，包括實體產品、App 介面、系統儀表板 Web-based 介面、網頁等，以及在大公司、小公司、Freelancer、現場和遠端的不同工作模式的經驗。\n- 通才、專才、 T 型人才\n\nW02: 為什麼要進行使用者研究？\n- 從失敗案例學習\n- 以人為本的設計與設計思考（Stanford d.school & 雙鑽石）\n- 使用者研究與方法的綜覽\n\nW03: 使用者研究方法\nW04: 使用者故事與人物誌 (Persona）\nW05: 腦力激盪法與同理心地圖\nW06: 使用者旅程地圖\nW07: 資訊架構：重要性、四個基本原則、方法（Card Sorting & Tree Test）\nW08: 原型製作\nW09: 期中考週\nW10: UX 寫作與設計溝通\nW12: 易用性測試\nW13: 開發流程與「那些超出產品本身」的體驗\nW14: 資料分析與簡報\nW15: AI 輔助 UX 的現況與趨勢\nW16: 期末報告 I\nW17: 期末報告 II\nW18: 期末考週：總結",
    "scorePolicy": "課堂作業\n內容：隨課程內容的練習\n提交方式：以該課堂介紹的線上工具提交\n期中作業\n內容：作品集主題的規劃\n提交方式：簡報\n期末作業\n內容：集結本堂課程使用者經驗實作的作品集與簡報 \n提交方式：以網頁呈現的作品集；課堂口頭簡報，每人 10 至 15 分鐘以內。\n\n態度 Attitude (10%): 準時 & 主動 Punctuality & Initiative\n獨立 Independence (5%)\n課堂互動 Classroom Interactive（15%） \n課堂作業（15%）\n期中報告 (15%)\n期末報告（25%）\n批判性思考（15%）",
    "materials": "自編教材",
    "consultation": "cic@ntut.edu.tw",
    "課程對應SDGs指標": "SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
