[
  {
    "name": "莊嶸騰",
    "email": "rtjuang@mail.ntut.edu.tw",
    "latestUpdate": "2024-05-22 11:51:13",
    "objective": "「太空軟體系統設計」課程旨在培養學生在太空任務中設計、開發和操作軟體系統的專業能力。學生將深入了解太空環境對軟體系統的特殊要求，包括真空、輻射、溫度等因素對系統性能的影響。課程將探討飛行軟體的設計和架構，學生將學習如何設計出能夠在極端條件下穩定運行的飛行軟體系統，確保太空任務的順利執行。此外，課程將涵蓋軟體驗證和確認技術，學生將學習如何確保軟體系統的功能性和安全性，並掌握各種測試方法和工具的應用。課程還將關注容錯和自我修復能力的設計，學生將學習如何設計具有容錯和自我修復功能的軟體系統，以應對可能的故障情況。最後，課程將介紹太空軟體系統的專案管理和實施，學生將學習如何有效地管理軟體開發專案，確保項目按時交付並符合品質標準。此外，課程還將包括深度學習在太空軟體系統中的應用，學生將探索如何利用深度學習技術來改進太空任務中的軟體系統設計和性能，以及酬載資料處理軟體的設計和開發，以支援太空任務中的資料收集和分析。通過本課程的學習，學生將具備設計和開發太空軟體系統所需的技能和知識，為未來在太空工程或相關領域的工作做好準備。The course aims to cultivate students' professional abilities in designing, developing, and operating software systems for space missions. Students will gain in-depth understanding of the special requirements that the space environment imposes on software systems, including the impact of factors such as vacuum, radiation, and temperature on system performance. The course will explore the design and architecture of flight software, teaching students how to design flight software systems that can operate stably under extreme conditions, ensuring the smooth execution of space missions. Additionally, the course will cover software verification and validation techniques, enabling students to ensure the functionality and safety of software systems and master various testing methods and tools. Attention will also be given to the design of fault tolerance and self-repair capabilities, teaching students how to design software systems with fault tolerance and self-repair capabilities to handle possible failure situations. Finally, the course will introduce project management and implementation of space software systems, teaching students how to effectively manage software development projects, ensuring timely delivery and compliance with quality standards. Furthermore, the course will include the application of deep learning in space software systems, allowing students to explore how to leverage deep learning technologies to improve the design and performance of software systems for space missions. It will also cover the design and development of payload data processing software to support data collection and analysis in space missions. Through this course, students will acquire the skills and knowledge required for designing and developing space software systems, preparing them for future work in space engineering or related fields.",
    "schedule": "Week 1: Introduction to Space Software Systems\nWeek 2: Space Environment and Its Impact on Software\nWeek 3: Basics of Flight Software Design\nWeek 4: Developing for Extreme Conditions\nWeek 5: Fault Tolerance in Space Software Systems\nWeek 6: Self-healing Software Mechanisms\nWeek 7: Software Verification and Validation\nWeek 8: Testing Methods and Tools\nWeek 9: Mid-Course Project Review\nWeek 10: Real-Time Systems and Embedded Software\nWeek 11: Data Handling and Payload Software Design\nWeek 12: Deep Learning Applications in Space Software\nWeek 13: Software Project Management for Space\nWeek 14: Simulation and Modeling Tools\nWeek 15: Industry Standards and Compliance\nWeek 16: Advanced Topics in Space Software Systems\nWeek 17: Finalizing Projects and Preparing for Deployment\nWeek 18: Course Recap and Final Presentations",
    "scorePolicy": "Midterm Exam (30%)\nFinal Exam (30%)\nHomework Assignments (20%)\nClass Participation (20%)",
    "materials": "Use of self-made materials",
    "consultation": "Office Hoursor Email: rtjuang@mail.ntut.edu.tw",
    "課程對應SDGs指標": "無（None）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
