[
  {
    "name": "莊嶸騰",
    "email": "rtjuang@mail.ntut.edu.tw",
    "latestUpdate": "2024-05-22 11:46:37",
    "objective": "本課程旨在結合人工智能和太空探索的前沿技術，教授學生如何將深度學習技術應用於解決太空技術中的複雜問題。課程內容涵蓋深度學習的基礎理論，包括神經網絡、卷積神經網絡、遞歸神經網絡以及強化學習，並將這些技術應用於衛星影像處理、太空探測器的自主導航以及航天器系統的異常檢測等太空任務。學生將學習如何處理和分析來自衛星的大量數據，並探索深度學習在提高太空任務效率和效能方面的潛力。課程還將討論在太空極端環境中實施人工智能技術的挑戰，包括數據限制、容錯需求以及硬件限制等問題。此外，課程將通過實際案例學習和模擬項目，使學生有機會使用實際的衛星數據和流行的深度學習框架如 TensorFlow 和 PyTorch 來開發自己的模型。通過本課程的學習，學生將能夠掌握將深度學習技術應用於太空科技的能力，為未來在人工智能和航太科學領域的職業生涯做好準備。\nThe course integrates the cutting-edge areas of artificial intelligence and space exploration. It aims to equip students with the skills to apply deep learning techniques to complex space-related challenges. This course emphasizes the use of neural networks, convolutional neural networks (CNNs), recurrent neural networks (RNNs), and reinforcement learning to improve and innovate space mission strategies. Students will begin with a foundation in deep learning principles, progressing to practical applications such as analyzing satellite imagery for Earth observation and remote sensing. This includes predicting weather patterns, monitoring environmental changes, and assessing damage from natural disasters using CNNs. The course will also delve into the development of autonomous navigation systems for space rovers and spacecraft using RNNs and reinforcement learning, highlighting AI’s role in enhancing the autonomy of space explorations. Additionally, the course will tackle the unique challenges of applying AI in space, such as data scarcity, the need for fault-tolerant systems, and ethical considerations. Practical components will involve hands-on projects using real satellite data and AI simulations to prepare students for real-world applications. By the end of the course, students will have a robust understanding of how deep learning can be deployed effectively in space technology, readying them for advanced careers in AI and aerospace industries.",
    "schedule": "Week 1: Course Introduction\nWeek 2: Introduction to Neural Networks\nWeek 3: Advanced Neural Networks\nWeek 4: Convolutional Neural Networks (CNNs)\nWeek 5: CNNs for Satellite Image Analysis\nWeek 6: Recurrent Neural Networks (RNNs)\nWeek 7: RNNs for Time Series Prediction\nWeek 8: Reinforcement Learning\nWeek 9: Autonomous Navigation Systems\nWeek 10: Anomaly Detection in Spacecraft Systems\nWeek 11: Handling Big Data from Satellites\nWeek 12: Deep Learning Frameworks Overview\nWeek 13: Project Mid-Review\nWeek 14: Challenges of Implementing AI in Space\nWeek 15: Fault Tolerance and Hardware Limitations\nWeek 16: Ethical Considerations and Future Implications\nWeek 17: Final Project Development\nWeek 18: Final Presentations and Course Wrap-up",
    "scorePolicy": "Midterm Exam (30%)\nFinal Exam (30%)\nHomework Assignments (20%)\nClass Participation (20%)",
    "materials": "Use of self-made materials",
    "consultation": "Office Hoursor Email: rtjuang@mail.ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
