[
  {
    "name": "郭建宏",
    "email": "kevinkuo@ntut.edu.tw",
    "latestUpdate": "2024-07-30 09:38:52",
    "objective": "本課程從 IPCC AR6 的氣候變遷科學事實出發，引導學生了解氣候變遷的重要性以及未來人類發展如何與氣候變遷結合。同時介紹組織、城市、國家如何計算其活動的溫室氣體排放量。本課程將整合目前國際通用方法 GHG protocol、國際標準 ISO 14064-1:2018 及國內環境部盤查指引為架構基礎，介紹溫室氣體的盤查、量化技巧，並透過各部門的溫室氣體排放源特性介紹及案例解析，讓學生能更清楚掌握溫室氣體盤查實務及第三方查證的核心重點。\nThis course begins with the scientific facts of climate change as presented in the IPCC AR6, guiding students to understand the importance of climate change and how future human development can integrate with it. It also introduces how organizations, cities, and countries calculate their greenhouse gas emissions. The course will integrate internationally accepted methods such as the GHG Protocol, ISO 14064-1:2018 international standards, and domestic guidelines from the Ministry of Environment as its foundational framework. It will cover greenhouse gas auditing and quantification techniques and provide analyses of case studies and characteristics of emission sources across various sectors, enabling students to grasp the practical aspects of greenhouse gas auditing and the core points of third-party verification more clearly.",
    "schedule": "第 1 週\t課程介紹\n第 2 週\t淺談氣候變遷科學評估報告 AR6\n第 3 週\t國內外氣候變遷治理與因應做法 (國家層級)\n第 4 週\t國內外氣候變遷治理與因應做法 (企業層級)\n第 5 週\t溫室氣體盤查方案介紹 (GHG protocol、ISO 14064-1:2018、環境部)\n第 6 週\t溫室氣體排放與移除量化 (企業層級 - 上)\n第 7 週\t溫室氣體排放與移除量化 (企業層級 - 中)\n第 8 週\t溫室氣體排放與移除量化 (企業層級 - 下)\n第 9 週\t期中考\n第 10 週\t能源部門溫室氣體排放源特性 (城市、國家層級)\n第 11 週\t工業製程部門溫室氣體排放源特性 (城市、國家層級)\n第 12 週\t廢棄物部門溫室氣體排放源特性 (城市、國家層級)\n第 13 週\t農業部門溫室氣體排放源特性 (城市、國家層級)\n第 14 週\t林業部門、土地利用變化溫室氣體排放源特性 (城市、國家層級)\n第 15 週\t分組報告：溫室氣體盤查清冊、報告書製作與第三方查證\n第 16 週\t碳抵換策略解析\n第 17 週\t碳中和規範與實踐\n第 18 週\t期末考",
    "scorePolicy": "作業及報告 30%\n期中 35%\n期末 35%",
    "materials": "PPT \nISO 14064-1:2018\nISO 14068-1:2023\nGHG protocol\n碳盤查核算方法學\n溫室氣體排放量盤查作業指引",
    "consultation": "億光大樓 12 樓 1206 室 分機 4183kevinkuo@ntut.edu.twchkuo@ntut.edu.tw",
    "課程對應SDGs指標": "SDG11：永續城市與社區（Sustainable Cities and Communities）SDG12：負責任的消費與生產（Responsible Consumption and Production）SDG13：氣候行動（Climate Action）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
