[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2024-08-22 17:55:54",
    "objective": "本課程將盡量從實務的角度來講解電子商務。\n\n內容將採用理論與實作並行的方式。\n\n課程理論部分將介紹電子商務的基本概念與實務操作，涵蓋從電子商務的定義、歷史發展、類型，到電子商務平台的介紹與實際應用。本課程將深入探討電子商務網站的開發，包括前端與後端平台的建構，以及網站開發中的關鍵技術，如響應式網頁設計、支付系統的整合與安全性考量。此外，課程中也將介紹如何利用網路流量分析工具如 Google Analytics 進行網站流量與用戶行為分析，並探討各種電子商務營銷策略，如 SEO 和社交媒體營銷。通過一系列的實作練習，學生將學習如何從零開始開發一個完整的電子商務網站，並掌握網站優化與後續分析的技巧。\n\n實作部分包括：1. 掌握電子商務網站開發的核心技術（從前端到後端）。2. 前端包括 Html/CSS/JavaScript，後端 PHP 與 MySQL 資料庫，這些練習對後續的用戶網頁行為代碼追蹤，非常重要。3. 應用流量分析工具 GA 與 GTM 代碼追蹤，來進行網站流量與用戶行為分析。4. 學習 SEO 技術，來提高網站在搜尋引擎結果中的排名，從而增加網站流量的策略。5. 架站與網域申請\n\nThis course will combine theoretical instruction with practical application.\n\nThe theoretical portion of the course will introduce the basic concepts and practical operations of e-commerce, covering everything from the definition, historical development, and types of e-commerce to an introduction to e-commerce platforms and their practical applications. The course will delve into the development of e-commerce websites, including the construction of both front-end and back-end platforms, as well as key technologies in website development, such as responsive web design, payment system integration, and security considerations. Additionally, the course will introduce how to use web traffic analysis tools like Google Analytics to analyze website traffic and user behavior, and explore various e-commerce marketing strategies, such as SEO and social media marketing. Through a series of practical exercises, students will learn how to develop a complete e-commerce website from scratch and master the techniques for website optimization and subsequent analysis.\n\nThe practical portion includes:\n1. Mastering the core technologies of e-commerce website development (from front-end to back-end).\n2. Front-end technologies include HTML/CSS/JavaScript, and back-end technologies include PHP and MySQL databases; these exercises are crucial for subsequent user webpage behavior tracking.\n3. Applying traffic analysis tools like GA (Google Analytics) and GTM (Google Tag Manager) for website traffic and user behavior analysis.\n4. Learning SEO techniques to improve the website's ranking in search engine results, thereby increasing website traffic.\n5. Website setup and domain registration.",
    "schedule": "Week 1: Course Introduction\n第 1 週：課程介紹\n\nWeek 2: Definition and History of E-commerce, Types of E-commerce (B2B, B2C, C2C, etc.)\n第 2 週：電子商務的定義與發展歷史，電子商務的類型（B2B, B2C, C2C, etc.）\n\nWeek 3: Introduction to E-commerce 7 Platforms\n第 3 週：經營電子商務的 7 種方式：【自建電商平台（Direct-to-Consumer, D2C），第三方平台銷售，微商，社交電商 (Social E-Commerce)，訂閱制電商 (Subscription E-Commerce)，Dropshipping，聯盟行銷 (Affiliate Marketing)】等\n\nWeek 4: Hands-on: Use Shopify to build your own e-commerce, control your own brand image, and establish a completely independent online store. And implement the comparison: Use Shopee to build a third-party e-commerce platform.\n第 4 週：實作：使用 shopify 自建電商，掌控自己的品牌形象，建立完全獨立的網店。並實作比較：使用蝦皮建立第三方電商平台。\n\nWeek 5: Practical Exercise: Developing the Front-end of an E-commerce Website (Html+CSS)\n第 5 週：實作：電子商務網站開發的架構（包括前端平台與後端平台與數據庫），開發前端商務網站前端平台（Html+CSS）\n\nWeek 6: Practical Exercise: Developing the Front-end of an E-commerce Website (JavaScript)\n第 6 週：實作：開發前端商務網站前端平台（JavaScript）\n\nWeek 7: Practical Exercise: Advanced Web Design / Current Mainstream Web Design: Responsive Web Design (RWD)\n第 7 週：實作：進階網頁設計 / 目前網頁設計主流：響應性網頁 RWD\n\nWeek 8: Practical Exercise: Website Deployment - Apache + PHP + MySQL\n第 8 週：實作：架設網站實務：Apache + PHP + MySQL\n\nWeek 9: Midterm Exam\n第 9 週：期中考\n\nWeek 10: Payment Systems and Security\n第 10 週：支付系統與安全\n\nWeek 11: Data Analysis and Optimization in E-commerce\n第 11 週：電商的數據分析與優化\n\nWeek 12: Analyzing Website Traffic and User Behavior: Common Traffic Analysis Tools (Google Analytics)\n第 12 週：分析網站流量與用戶行為：常用分析流量工具（Google Analytics）\n\nWeek 13: E-commerce Marketing Strategies and Techniques (SEO, SEM, Social Media Marketing)\n第 13 週：電子商務營銷策略與手段（SEO, SEM, 社交媒體營銷）\n\nWeek 14: Practical Exercise: Back-end Platform Construction Techniques: PHP (1)\n第 14 週：實作：後端平台的建構技術：PHP (1)\n\nWeek 15: Practical Exercise: Integration of Back-end Web and Database: PHP + MySQL (1)\n第 15 週：實作：後端網頁結合資料庫的技術：PHP + MySQL (1)\n\nWeek 16: Practical Exercise: Integration of Back-end Web and Database: PHP + MySQL (2)\n第 16 週：實作：後端網頁結合資料庫的技術：PHP + MySQL (2)\n\nWeek 17: Practical Exercise: Using Google Analytics for Traffic Tracking and Analysis\n第 17 週：實作：用 Google Analytics 進行客戶流量追蹤與流量分析\n\nWeek 18: Final Exam\n第 18 週：期末考",
    "scorePolicy": "1. 上課實作範例加分 30%，作業分數 10%，期中考 30%，期末考 30%\n2.735 教室不是傳統的電腦教室，是一般教室。要自己帶筆電。\n3.EMI 英文授課\n\n1.In-class practical examples contribute 30% to the final grade, assignments account for 10%, the midterm exam is 30%, and the final exam is 30%.\n2.Room 735 is not a traditional computer lab but a regular classroom. Students need to bring their own laptops.",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/Ecommerce\n2. 參考書目：《電子商務網站開發實務》，李永熙，旗標出版公司\n3. 參考書目：《電子商務概論與應用》，陳彥宇，前程文化出版\n\n1.Self-compiled teaching website: https://acupun.site/lecture/Ecommerce\n2.Reference book: Practical E-commerce Website Development by Li Yongxi, Flag Publishing Co.\n3.Reference book: Introduction and Application of E-commerce by Chen Yanyu, Qiancheng Culture Publishing.",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "remarks": "EMI 英文授課建議同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：大數據分析",
    "foreignLanguageTextbooks": false
  }
]
