[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2024-08-20 19:42:06",
    "objective": "本課程將採用理論與實作並行的方式。\n\n首先建立學生對各類顧客關係管理 CRM 相關議題之基礎理論架構觀念，奠定學生日後從事顧客關係管理分析研究工作時之需。CRM 乃在做【市場區隔】與【選擇目標客戶】，並做【差異性行銷】，其步驟為：1. 市場調查和分析，2. 選擇目標客戶市場，3. 制定營銷策略，4. 實施和監控，CRM 根據藉由上述各種溝通管道所蒐集到的顧客資料，進而分析顧客行為，做市場區隔與選擇目標客戶，然後做差異性行銷，作為企業決策判斷的依據。\n\n本課程在隨著不同章節的講解，會帶領同學們實作與課程相關的 4 種數位工具與資訊技術。\n\nThis course aims to establish a foundational theoretical framework for students on various Customer Relationship Management (CRM) related topics, preparing them for future analysis and research work in CRM. CRM involves market segmentation and target customer selection, followed by differentiated marketing. The steps include: 1. Market research and analysis, 2. Selection of target customer markets, 3. Formulation of marketing strategies, 4. Implementation and monitoring. CRM utilizes customer data collected through various communication channels to analyze customer behavior, perform market segmentation, and select target customers, subsequently conducting differentiated marketing. This serves as the basis for business decision-making. Throughout the course, different chapters will guide students in the practical implementation of four relevant digital tools and information technologies.",
    "schedule": "第 1 週：課程介紹 CRM 概述\n第 2 週：客戶資料管理，與市場區隔與目標客戶選擇\n第 3 週：客戶價值與忠誠度管理，\n第 4 週：客戶互動與溝通管理\n第 5 週：實作：傳統手機客戶數據方法：Google 客戶問卷調查表單\n第 6 週：實作：Google 客戶問卷調查表單的製作的 10 種特殊技巧\n第 7 週：實作：傳統量化分析方法：SPSS 軟體\n第 8 週：實作：SPSS 的單一樣本 t 檢定，獨立樣本 t 檢定\n第 9 週：期中考\n第 10 週：實作：SPSS 的單因子變異數分析，迴歸分析\n第 11 週：數位時代的 CRM，CRM 系統選型與實施\n第 12 週：CRM 的績效評估與改進，客戶體驗管理\n第 13 週：CRM 的未來趨勢與挑戰\n第 14 週：實作：程式量化分析方法：Python 統計分析 (scipy 統計模組)\n第 15 週：實作：Python 統計分析：單變數卡方檢定（類別 x vs 類別 y）\n第 16 週：實作：應用人工智慧於顧客區隔（Customer Segmentation）的分群預測，可找出不同的目標客群，然後做差異性行銷\n第 17 週：實作：用人工智慧技術的 sklearn 模組，建立機器學習模型來預測『客戶關係管理裡面的客戶價值度』\n第 18 週：期末考",
    "scorePolicy": "1. 中文授課\n\n2. 735 教室不是傳統的電腦教室，是一般教室。要自己帶筆電。\n\n3. 北聯大的跨校選課同學，請先確定幾件事，再決定是否要選修這門課。\n因為課程會使用到北科大軟體雲裡面的軟體，必須使用北科大的學生帳號密碼登入，請先確定跨校選修學生，是否能夠取得登入帳號密碼的權限，再決定是否要選修這門課。\n課堂也必須登入 Zuvio，上傳作業 / 考試檔案 / 或課堂加分等。前提也必須有帳號密碼才能夠登入。\n\n4. 上課實作範例加分 30%，作業分數 10%，期中考 30%，期末考 30%",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/CRM/\n\n2. 參考書目：《客戶關係管理》，黃俊杰，高等教育出版社\n\n3. 參考書目：\"Customer Relationship Management: Concepts and Technologies\"，Author: Francis Buttle, Stan Maklan，Publisher: Routledge",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "課程對應SDGs指標": "SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "remarks": "建議同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：大數據分析",
    "foreignLanguageTextbooks": false
  }
]
