[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2024-08-13 01:34:10",
    "objective": "建立學生對各類顧客關係管理 CRM 相關議題之基礎理論架構觀念，奠定學生日後從事顧客關係管理分析研究工作時之需。CRM 乃在做【市場區隔】與【選擇目標客戶】，並做【差異性行銷】，其步驟為：1. 市場調查和分析，2. 選擇目標客戶市場，3. 制定營銷策略，4. 實施和監控，CRM 根據藉由上述各種溝通管道所蒐集到的顧客資料，進而分析顧客行為，做市場區隔與選擇目標客戶，然後做差異性行銷，作為企業決策判斷的依據。本課程在隨著不同章節的講解，會帶領同學們實作與課程相關的 4 種數位工具與資訊技術。\n\nThis course aims to establish a foundational theoretical framework for students on various Customer Relationship Management (CRM) related topics, preparing them for future analysis and research work in CRM. CRM involves market segmentation and target customer selection, followed by differentiated marketing. The steps include: 1. Market research and analysis, 2. Selection of target customer markets, 3. Formulation of marketing strategies, 4. Implementation and monitoring. CRM utilizes customer data collected through various communication channels to analyze customer behavior, perform market segmentation, and select target customers, subsequently conducting differentiated marketing. This serves as the basis for business decision-making. Throughout the course, different chapters will guide students in the practical implementation of four relevant digital tools and information technologies.",
    "schedule": "第 1 週：課程介紹 CRM 概述\n第 2 週：客戶資料管理，與市場區隔與目標客戶選擇\n第 3 週：客戶價值與忠誠度管理，\n第 4 週：客戶互動與溝通管理\n第 5 週：實作：傳統手機客戶數據方法：Google 客戶問卷調查表單\n第 6 週：實作：Google 客戶問卷調查表單的製作的 10 種特殊技巧\n第 7 週：實作：傳統量化分析方法：SPSS 軟體\n第 8 週：實作：SPSS 的單一樣本 t 檢定，獨立樣本 t 檢定\n第 9 週：期中考\n第 10 週：實作：SPSS 的單因子變異數分析，迴歸分析\n第 11 週：數位時代的 CRM，CRM 系統選型與實施\n第 12 週：CRM 的績效評估與改進，客戶體驗管理\n第 13 週：CRM 的未來趨勢與挑戰\n第 14 週：實作：程式量化分析方法：Python 統計分析 (scipy 統計模組)\n第 15 週：實作：Python 統計分析：單變數卡方檢定（類別 x vs 類別 y）\n第 16 週：實作：應用人工智慧於顧客區隔（Customer Segmentation）的分群預測，可找出不同的目標客群，然後做差異性行銷\n第 17 週：實作：用人工智慧技術的 sklearn 模組，建立機器學習模型來預測『客戶關係管理裡面的客戶價值度』\n第 18 週：期末考",
    "scorePolicy": "1. 這門課是比較簡單的課程，不要看到統計就覺得難。課程都是軟體操作 (類似操作 word)，雖然課程必須做很多問卷的統計分析實作，但是完全沒有計算，都是使用軟體操作，只需要看一張 x,y 變數分類表圖即可判別該用哪 1 種統計方法，因此整體上是屬於簡單易學的，但對未來卻又很實用，未來在碩士論文或行銷報告的撰寫，都有大幫忙。\n\n2.SPSS 軟體是傳統社會科學研究，一定必須要會使用的工具。\n\n3. 上課實作範例加分 30%，作業分數 10%，期中考 30%，期末考 30%\n\n4.735 教室不是傳統的電腦教室，是一般教室。要自己帶筆電。",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/CRM/\n\n2. 參考書目：《客戶關係管理》，黃俊杰，高等教育出版社\n\n3. 參考書目：\"Customer Relationship Management: Concepts and Technologies\"，Author: Francis Buttle, Stan Maklan，Publisher: Routledge",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 可以在北科 i 學園 PLUS 平台，在課程內留言，諮詢問題 3. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "課程對應SDGs指標": "SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "remarks": "建議同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：大數據分析",
    "foreignLanguageTextbooks": false
  }
]
