[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2024-08-20 19:48:25",
    "objective": "本課程將採用理論與實作並行的方式。\n\n課程理論部分是在探討因為隨著數位轉型、人工智慧、大數據、區塊鏈及綠色科技等科技創新，產生了各種新的經營模式，例如：按需經濟、訂閱經濟、智能製造經濟、共享經濟、平台經濟、數據經濟、零工經濟、循環經濟、體驗經濟、分散式金融經濟等，企業的經營環境發生了明顯的變化。本課程將從經營模式的基本概念入手，深入解析這些創新科技如何影響並改造傳統的商業模式，並通過實際案例分析，幫助學生理解成功與失敗的經營模式設計。學生將學習如何運用經營模式畫布等工具，設計出符合市場需求和科技趨勢的創新經營模式。此外，課程還將展望未來科技發展的可能趨勢，討論企業如何預測並適應未來變革。\n\n實作部分，聚焦在【人工智慧，與大數據分析】對經營模式的各種應用，課堂會用 Python 結合人工智慧技術的機器學習與深度學習模型，應用在各種商情預測的實例上。\n\nThis course will combine theoretical instruction with practical application.\n\nThe theoretical portion of the course will explore how technological innovations such as digital transformation, artificial intelligence, big data, blockchain, and green technology have given rise to various new business models. These include On-Demand Economy, Subscription Economy, Smart Manufacturing Economy, Sharing Economy, Platform Economy, Data Economy, Gig Economy, Circular Economy, Experience Economy, and Decentralized Finance Economy, all of which have significantly altered the business environment. The course will begin with the basic concepts of business models, providing an in-depth analysis of how these innovative technologies impact and transform traditional business models. Through real-world case studies, students will gain insights into successful and unsuccessful business model designs. Students will also learn how to use tools like the Business Model Canvas to design innovative business models that align with market demands and technological trends. Additionally, the course will look ahead to potential future technological developments, discussing how businesses can anticipate and adapt to future changes.\n\nThe practical portion will involve using Python in combination with artificial intelligence techniques such as machine learning and deep learning, applied to business forecasting.",
    "schedule": "第 1 週：課程介紹\n第 2 週：創新科技的概念與影響，\n第 3 週：使用【經營模式畫布】評估企業的經營模式\n第 4 週：數位轉型與經營模式創新\n第 5 週：實作：ptyhon 人工智慧『簡易 3 步驟』程式寫法 (簡易基礎 13 題)\n第 6 週：實作：ptyhon 人工智慧建立『KNN，邏輯迴歸』模型來預測『客戶關係管理裡面的客戶價值度』\n第 7 週：實作：ptyhon 人工智慧建立『線性迴歸，非線性迴歸多項式』模型來預測『美元 - 黃金』關係\n第 8 週：實作：ptyhon 人工智慧建立『主成份分析 PCA』降維模型，來預測『產品各種參數對品質的』影響關係\n第 9 週：期中考\n第 10 週：實作：ptyhon 人工智慧建立建立『類神經網路』來預測『客戶評估面紙的好壞』\n第 11 週：平台經濟與共享經濟，對經營模式的創新改革\n第 12 週：人工智慧與數據分析，對經營模式的創新改革\n第 13 週：區塊鏈技術與綠色科技，對經營模式的創新改革\n第 14 週：實作：ptyhon 人工智慧建立建立『類神經網路』來預測房價\n第 15 週：實作：ptyhon 人工智慧建立建立『SVC 支持向量機模型』，來預測『員工流失率』\n第 16 週：實作：ptyhon 人工智慧建立建立『隨機森林法模型』，來預測『IBM 電信的客戶流失率』\n第 17 週：實作：ptyhon 人工智慧建立建立『決策樹模型』，來預測『歐洲信用卡公司盜刷』並預測 A 客戶是否會盜刷\n第 18 週：期末考",
    "scorePolicy": "1. 中文授課\n\n2. 上課實作範例加分 30%，作業分數 10%，期中考 30%，期末考 30%\n\n3.735 教室不是傳統的電腦教室，是一般教室。要自己帶筆電。",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/innovation/\n\n2. 參考書目：《數位轉型與商業模式創新》，張家齊、李勇毅，天下文化出版社\n\n3. 參考書目：\"The Innovator's Dilemma: When New Technologies Cause Great Firms to Fail\"，Clayton M. Christensen, Harvard Business Review Press",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "課程對應SDGs指標": "SDG8：尊嚴就業與經濟發展（Decent Work and Economic Growth）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "remarks": "建議同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：大數據分析",
    "foreignLanguageTextbooks": false
  }
]
