[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2025-09-08 14:11:13",
    "objective": "顧客關係管理主要目的是了解企業與顧客之關係，促使顧客滿意及忠誠回應而產生終身價值，進而提昇企業獲利，其內容包括顧客關係管理的概念與本質、顧客行為、顧客資料探勘、顧客關係管理系統、顧客關係管理專案之規劃與管理、顧客關係管理的績效衡量、顧客關係管理實務研討。商業智慧 (Business Intelligence, BI)，是企業利用現代資訊技術收集、管理和分析結構化與非結構化的企業資料與資訊，創造和累積企業知識與見解，以改善企業決策品質與採取有效的企業行動，進而提升企業各方面績效。由基本現場管理 (Shop Floor Control) 需求談起，然後介紹製造資訊分類與收集技術（包括 RFID），也將包括資料庫與資料倉儲觀念，最後介紹 BI 於顧客關係管理之應用。課堂中也將輔以目前市面上商用 BI 套裝軟體，並將其專業上相關資訊在此系統上實際應用，體驗 BI 對企業之重要性。\nThe objectives of Customer Relationship Management (CRM) are to study the relationship between corporation and customer, to increase the profit by customer lifetime value through customer satisfaction and royalty. The topics of this course includes concepts and context of CRM, consumer behavior, customer data mining, CRM system, planning and management of CRM projects, performance measurement of CRM. Business intelligence (BI) systems refer to applications and technologies which gather and analyze data about company operations. It then provides a comprehensive correlation of those factors, such as metrics on sales, production, internal operations, and helps managers to make better business decisions. This course focuses on applications of BI in CRM, with the introduction of shop floor control concepts and data collection techniques such as RFID, along with database and data warehouse concepts. Hands-on experience in BI software implementation is also emphasized.",
    "schedule": "1~ 4 週\n第一單元 瞭解顧客服務與關係管理的市場\n第 1 章 在顧客關係管理與服務經濟中創造價值\n第 2 章 瞭解顧客關係管理與服務業的顧客 \n第 3 章 競爭市場中的貫課關係管理與服務定位\n\n5~7 週\n第二篇 服務業的行銷 4P 第 4 章 開發服務產品和品牌 \n第 5 章 透過實體與電子通路傳遞關係管理與服務管理\n第 6 章 顧客服務定價及營收管理 \n第 7 章 顧客服務行銷溝通\n\n第 8 週  期中考試週  -- 分組報告\n\n9~11 週\n第三篇 管理顧客介面 第 8 章 設計服務流程 \n第 9 章 平衡需求與產能 \n第 10 章 精心設計顧客服務與體驗環境場景\n第 11 章 顧客服務優勢來自人員管理\n\n12 週校外教學\n\n13~16 週\n第四篇 培養顧客關係  \n第 12 章 管理顧客關係與培養忠誠度 \n第 13 章 申訴處理及服務補救\n\n第五篇 追求顧客關係管理、顧客服務卓越. \n第 14 章 改善服務品質和生產力 \n第 15 章 打造一流的服務組織\n\n第 17 週 模擬軟體\n\n第 18 週。 期末考試週",
    "scorePolicy": "Evaluation/Assessments：\n\nMid Term      25%\t( Group Presentation, individual report )\nFinal Term    25%\t( Paper Exam + Group Presentation )\n\nParticipation  50%  ( 20% Attendance on time got 2 points, 30% Class  participation, such as asking and answering questions)\nProof of documents required, such as a sick leave notice, can be provided later.\nA wrap-up presentation of the previous class may be required in the next class.\n360-degree evaluation at the end of the class by peers.\nContact information:   Email: shenchu.yang@gmail.com | Cell Phone: 0932302756 | Line: shenchu.yang    Wechat: shenchu_yang",
    "materials": "顧客關係管理｜結合叡揚資訊 Vital CRM 國際專業認證 (第二版) \n\n作者： 陳美純\t\n書號： AEE040600\t    出版日： 2023/02/22\nISBN： 9786263244184\t    EAN： 9786263244184\n紙本書價格： 480\t    電子書： \t已出版\n\n曾鼎翔，2019，服務業行銷 (Wirtz/Services Marketing 8e)，台北：華泰文化",
    "consultation": "提前安排雙方合宜時間",
    "課程對應SDGs指標": "SDG3：良好健康和福祉（Good Health and Well-being）SDG11：永續城市與社區（Sustainable Cities and Communities）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "課程是否導入AI": "● 使用生成式 AI 作為教學過程的輔助工具（Use generative AI tools as an aid to the teaching process）● 鼓勵學生使用生成式 AI 工具（Encourage students to use generative AI tools）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
