[
  {
    "name": "邱俊智",
    "email": "ccchiuv@ntut.edu.tw",
    "latestUpdate": "2025-05-28 19:54:34",
    "objective": "This course aims to provide students with a comprehensive understanding of digital transformation and its impact on business models. Students will explore how emerging technologies are reshaping industries and driving innovation in business strategies. Through case studies, practical exercises, and theoretical frameworks, participants will learn to analyze, design, and implement digital transformation initiatives that align with organizational goals. The course will also focus on developing students' ability to apply digital twin technologies to enhance value creation, competitiveness, and customer engagement through innovative business models.\n本課程旨在教授學生可以全面了解數位轉型及其對商業模式影響的知識。學生將探討新興技術如何重塑產業並推動創新的商業策略中。透過個案研究、實際操作和理論框架，學生將學習如何分析、設計和實施符合個案公司目標的數位轉型計劃。課程還將著重培養學生應用數位雙生之技術，以創建運用數位技術提升價值創造、競爭力和客戶參與度的創新商業模式。",
    "schedule": "1.\tIntroduction\n2.\tDigital transformation (DT)-concept\n3.\tBusiness innovation Intelligence, Data Science, and Data Analytics\n4.\tSocial Media and Semantic Web Technology\n5.\tOmnichannel Retailing, E-commerce, and Mobile Commerce Technology\n6.\tDT for an international airport baggage handling system\n7.\tDT for an intelligent traffic system.\n8.\tDT for intelligent e-commerce planning\n9.\tMidterm presentation \n10.\tThe introduction of Digital twins in different applications\n11.\tDigital twin tool in the production system (Software Implementation)\n12.\tDigital twin tool in the service system (Software Implementation)\n13.\tDigital twin tool in intelligent e-commerce system (Software Implementation)\n14.\tFunctional Business Systems\n15.\tDiscussion\n16.\tTerm project presentation \n17.\tTerm project presentation\n18.\tFinal week",
    "scorePolicy": "Attendance: 10%\nCase Discussion, Presentation, and Assignment: 50%\nFinal Project: 40%",
    "materials": "1. Self-compiled material\n2. Alex Zarifis, Despo Ktoridou, Leonidas Efthymiou, Xusen Cheng (2023) Business Digital Transformation Selected Cases from Industry Leaders. Palgrave Macmillan. ISBN: 9783031336645\n3. Turban. (2021). Information Technology for Management 12/e IA. John Wiley. ISBN: 9781119802525",
    "consultation": "Office Hours: Tuesday 10:00 AM - 16:00 PM. Please schedule a discussion time via email in advance.",
    "課程對應SDGs指標": "SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "課程是否導入AI": "● 使用生成式 AI 作為教學過程的輔助工具（Use generative AI tools as an aid to the teaching process）● 鼓勵學生使用生成式 AI 工具（Encourage students to use generative AI tools）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
