[
  {
    "name": "楊侑倫",
    "email": "y.yang@ntut.edu.tw",
    "latestUpdate": "2025-05-27 21:17:21",
    "objective": "This course aims to provide an in-depth understanding of the various mechanical properties of engineering materials. Content covers the behavior of materials under different loading and environmental conditions, including elastic deformation, plastic deformation, hardness, impact toughness, fatigue, and creep. Students will learn the principles and methods for testing these properties and will gain hands-on experience through laboratory sessions. The course emphasizes the integration of theory and practice, enabling students to apply knowledge of material mechanical properties to engineering design and material selection. Specific teaching weeks will include laboratory sessions, online teaching, and open-book exams, requiring active student participation, data collection, and discussion.\n\nImportant Course Notes\n\nInternational Student Friendly: This course is designed to be welcoming and supportive for international students.\n\nLanguage of Instruction and Assessment: For all students (domestic and international), all questions, presentations, and examinations must be completed in English.\n\nLaboratory Requirement: This course includes several laboratory sessions. Experimental results and reports will be discussed in class and will form an important basis for continuous assessment.\n\nOpen-Book Exam Procedure: For open-book exams, students must come to the classroom to collect the exam paper, then may proceed to the library to research and answer the questions. Answers and findings will be discussed collectively at the end of the relevant class session.\n\nOnline Teaching Weeks: Specific teaching weeks will be conducted online. Please check the Microsoft Teams for access details and materials.\n\n\n本課程旨在深入探討工程材料的各種機械性質。內容涵蓋材料在不同負載與環境條件下的行為，包括彈性變形、塑性變形、硬度、衝擊韌性、疲勞與潛變等。學生將學習這些性質的測試原理與方法，並透過實驗課實際操作相關測試。課程強調理論與實務結合，使學生能將材料機械性質的知識應用於工程設計與材料選用。特定教學週將包含實驗課程、線上教學及開書考試，要求學生主動參與並進行資料搜集與研討。\n\n課程重要事項 (Important Course Notes)\n\n國際學生友善課程： 本課程致力於為國際學生營造一個友善且具支持性的學習環境。\n\n授課與評量語言： 所有學生（含本地生及國際學生）的課堂提問、口頭報告及所有考試均需使用英文完成。\n\n實驗課程要求： 本課程包含多次實驗課。實驗結果與報告將於課堂中討論，並作為平時考核之重要依據。\n\n開書考試程序： 開書考試時，學生須至教室領取試題，隨後可至圖書館查詢資料以完成作答。答案及研討成果將於該次課程結束前進行討論。\n\n線上教學週： 特定教學週將採線上教學。請留意 Microsoft Teams 以獲取登入詳情及教材。",
    "schedule": "Week 1: Introduction: Importance of mechanical properties of materials; Basic concepts of stress and strain.\n\nWeek 2: Elastic Deformation: Hooke's Law, elastic moduli (Young's, Shear), Poisson's ratio.\n\nWeek 3: (Lab Session) Tensile Testing Lab #1 (Determination of Elastic Properties): Determining Young's Modulus, Yield Strength.\n\nWeek 4: (Online Teaching) Plastic Deformation: Yielding phenomena, strain hardening, tensile strength, ductility.\n\nWeek 5: (Open-Book Exam #1 & Lecture) True Stress-True Strain curves; Introduction to hardness principles.\n\nWeek 6: Hardness Testing Methods: Brinell, Rockwell, Vickers, Knoop hardness tests.\n\nWeek 7: (Lab Session) Hardness Testing Lab #2 (Performing various hardness tests).\n\nWeek 8: (Online Teaching) Impact Loading and Fracture; Impact Testing (Charpy, Izod); Ductile-Brittle Transition Temperature.\n\nWeek 9: (Midterm Exam & Lab Session) Midterm Examination ; Impact Testing Lab #3 (Charpy impact test).\n\nWeek 10: (Open-Book Exam #2 & Lecture) Introduction to Fracture Mechanics; Stress concentration.\n\nWeek 11: Fatigue of Materials: S-N curves, fatigue mechanisms, factors affecting fatigue life.\n\nWeek 12: (Lab Session) Fatigue Testing Lab #4 (Introduction/Demonstration if equipment allows, or fatigue data analysis).\n\nWeek 13: (Online Teaching) Creep of Materials: Creep mechanisms, creep curves, stress rupture.\n\nWeek 14: (Open-Book Exam #3 & Lecture) Strengthening Mechanisms in Metals: Grain size reduction, solid solution strengthening, precipitation hardening, work hardening.\n\nWeek 15: (Lab Session) Microstructure-Property Relationship Lab #5 (e.g., observing effects of heat treatment/deformation on microstructure and relating to hardness/strength).\n\nWeek 16: Mechanical Behavior of Polymers or Ceramics (overview of one or both).\n\nWeek 17: Course Summary & Review Session.\n\nWeek 18: Final Examination \n\n\n\n第一週： 課程導論：材料機械性質的重要性；應力與應變基本概念。\n\n第二週： 彈性變形：虎克定律、彈性模數、楊氏模數、剪切模數、蒲松比。\n\n第三週：(實驗課) 拉伸試驗實驗 #1 (彈性性質測定)：測定楊氏模數、降伏強度。\n\n第四週：(線上教學) 塑性變形：降伏現象、應變強化、抗拉強度、延伸率。\n\n第五週：(開書考試 #1 & 授課) 真應力 - 真應變曲線；硬度原理介紹。\n\n第六週： 硬度試驗方法：勃氏、洛氏、維氏、努氏硬度試驗。\n\n第七週：(實驗課) 硬度試驗實驗 #2 (執行各種硬度測試)。\n\n第八週：(線上教學) 衝擊負載與破壞；衝擊試驗 (夏比、艾若特)；韌脆轉變溫度。\n\n第九週：(期中考試 & 實驗課) 期中考試 ；衝擊試驗實驗 #3 (夏比衝擊試驗)。\n\n第十週：(開書考試 #2 & 授課) 破壞力學導論；應力集中。\n\n第十一週： 材料疲勞：S-N 曲線、疲勞機制、影響疲勞壽命之因素。\n\n第十二週：(實驗課) 疲勞試驗實驗 #4 (設備許可下進行簡介 / 演示，或疲勞數據分析)。\n\n第十三週：(線上教學) 材料潛變：潛變機制、潛變曲線、應力破壞。\n\n第十四週：(開書考試 #3 & 授課) 金屬強化機制：晶粒細化、固溶強化、析出強化、加工硬化。\n\n第十五週：(實驗課) 顯微結構與性質關聯實驗 #5 (例如：觀察熱處理 / 加工對顯微結構之影響，並與硬度 / 強度建立關聯)。\n\n第十六週： 高分子材料或陶瓷材料之機械性質 (擇一或兩者概要介紹)。\n\n第十七週： 課程總結與複習。\n\n第十八週：期末考試",
    "scorePolicy": "The final grade will be determined based on the following components:\n課程總成績將依下列項目評定：\n\nAttendance (出席率): 10%\n\nLaboratory Reports, Assignments & Open-Book Exam Participation/Discussion (實驗課程報告、作業及開書考試參與 / 討論): 20%\n\nClassroom Conduct & Impression Score (課堂行為與印象分數): 20%\n\nTo maintain a productive learning environment and ensure classroom discipline, all students are expected to actively engage with the course material and refrain from disruptive activities. 為維持良好學習環境及課堂紀律，所有學生應專注於課程內容，避從事干擾教學之行為。\nStudents found engaging in personal activities unrelated to the course content during class time (e.g., using mobile phones for social media, playing games, attending to private work) will, for that particular class session, receive a zero mark for their conduct/impression score, impacting this portion of the grade. 若於課堂時間從事與課程內容無關之個人事務，該堂課之印象分數或相關參與度評分將以零分計算，此將影響本項成績。\nMidterm Examination (期中考試): 25%\n\nFinal Examination (期末考試): 25%",
    "materials": "Mechanical Behavior of Materials 5/E. 作者：DOWLING & KAMPE & KRAL. 出版社：PEARSON",
    "consultation": "Teams",
    "課程對應SDGs指標": "無（None）",
    "課程是否導入AI": "● 使用生成式 AI 作為教學過程的輔助工具（Use generative AI tools as an aid to the teaching process）● 鼓勵學生使用生成式 AI 工具（Encourage students to use generative AI tools）● 使用生成式 AI 進行課堂即時互動（Use generative AI for real-time classroom interaction）● 簡單介紹 AI 的基本概念（Briefly introduce the basic concept of AI）● 深入探討 AI 的原理與應用（Explore the principles and applications of AI in depth）",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
