[
  {
    "name": "楊濠瞬",
    "email": "haoshun@ntut.edu.tw",
    "latestUpdate": "2025-08-30 22:02:32",
    "objective": "1. 傳輸線\n2. 散射參數\n3. 微波主動元件\n4. 功率放大器\n5. 振盪器\n1. Transmission Line\n2. Scattering Parameters\n3. Microwave Active Components\n4. Power Amplifier\n5. Oscillator\nUnderstanding the theory, applications, and implementation of microwave active circuits including the power amplifier, and oscillator etc.",
    "schedule": "Week 1: Introduction\nWeek 2: Basic Concepts in RF Design and Wireless Standards\nWeek 3: Challenge of Power Amplifier (PA)\nWeek 4: Power Amplifier Circuits\nWeek 5: Transmitter (Tx)\nWeek 6: UE and BS Transmitter requirements\nWeek 7: GaN PAs for 5G systems\nWeek 8: Experiment: Load-Pull test theory and data processing (RF PA performance index and Load-Pull introduction)\nWeek 9: Experiment: Load-Pull test theory and data processing (PA Load-Pull simulation and Load-Pull measurement environment)\nWeek 10: Experiment: Generative Adversarial Network (GAN) model design and training (Concept of deep learning: neural network structure, loss function, and optimization)\nWeek 11: Experiment: Generative Adversarial Network (GAN) model design and training (GAN architecture and application, the roles and principles of generators and discriminators)\nWeek 12: Experiment: Data completing, performance analysis, and optimization (Comparison between GAN data completing and traditional interpolation methods)\nWeek 13: Experiment: Data completing, performance analysis, and optimization (Performance evaluation of GAN data completing)\nWeek 14: Project I: Power amplifier implementation\nWeek 15-17: Project II: Oscillator theory, design, simulation, and implementation\nWeek 18: Projects measurement and demo",
    "scorePolicy": "實作一 Project I : 50%  (電路特性: 35% , 口試: 15%)\n實作二 Project II : 50%  (電路特性: 35% , 口試: 15%)\n\n需自備至少 Win10 以上和 16GB 記憶體的筆電.",
    "materials": "RF Microelectronics by Behzad Razavi",
    "consultation": "Email: haoshun@mail.ntut.edu.tw",
    "課程對應SDGs指標": "無（None）",
    "課程是否導入AI": "● 使用生成式 AI 作為教學過程的輔助工具（Use generative AI tools as an aid to the teaching process）",
    "remarks": "Email: haoshun@mail.ntut.edu.twTeams",
    "foreignLanguageTextbooks": true
  }
]
