[
  {
    "name": "廖瑩",
    "email": "yliao@ntut.edu.tw",
    "latestUpdate": "2025-06-02 11:46:36",
    "objective": "本課程涵蓋太空系統工程的進階課題，包括當前研究和新興技術。本課程將深入理解太空系統的設計、開發、測試和實施，著重於子系統的整合和系統性能的最佳化。主題將包括先進的材料和結構、推進系統、航電系統、控制系統、人因因素等。學生將通過案例研究、設計專案和模擬實例進行學習。\nThis course covers advanced topics in space systems engineering, including current research and emerging technologies. The course will provide an in-depth understanding of the design, development, testing, and implementation of space systems, with a focus on the integration of subsystems and the optimization of system performance. Topics will include advanced materials and structures, propulsion systems, avionics, control systems, human factors, and more. Students will gain hands-on experience through case studies, design projects, and simulation exercises.",
    "schedule": "week 1: Class Introduction; SE principles and process\nweek 2: Holiday\t\t\t\nweek 3: Project management; Space System Design and Architecture\nweek 4: System architecture and design principles\nweek 5: System interfaces and data management; SysML introduction \nweek 6: SysML hands-on practice\nweek 7: Spacecraft Subsystem\nweek 8: System V&V\nweek 9: Midterm\nweek 10: System Operation\nweek 11 - 14: SysML hands-on practice\nweek 15 - 16: Project presentation\nweek 17: Final Exam\nweek 18: Review",
    "scorePolicy": "Homework 40%\nIn-class participation 10%\nBook Report Project 15%\nMidterm Exam 15%\nFinal Exam 20%",
    "materials": "Reference:\nSimple SysML for Beginners: Using CATIA No Magic Products (Simple for Beginners Book 2)\nAuthor: David Hetherington, Olivier Casse, and Frank Braun",
    "consultation": "Send a mail to: yliao@ntut.edu.tw",
    "課程對應SDGs指標": "SDG4：優質教育（Quality Education）SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）",
    "課程是否導入AI": "● 使用生成式 AI 作為教學過程的輔助工具（Use generative AI tools as an aid to the teaching process）● 鼓勵學生使用生成式 AI 工具（Encourage students to use generative AI tools）",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
